{
  "greetings": ["hello", "hi", "Hey", "greetings", "hey, how are you?"],
  "faq_root": [
    "What is intelligent transportation system (ITS)?",
    "How does weather affect traffic?",
    "What are some ways to alleviate traffic during rush hour?",
    "How can traffic be reduced?",
    "What causes traffic congestion?",
    "How long will it take to reach my destination during rush hour traffic?",
    "What is the best time to leave to avoid the traffic?",
    "Is there a way to avoid the traffic?",
    "How Long does it take for my traffic report to be processed?",
    "Can I provide video insted of images?",
    "What items do I need to provide to make a report?",
    "What can I ask you?"
  ],
  "goodbye": [
    "goodbye",
    "bye",
    "later",
    "See you later",
    "Take care",
    "Catch you later",
    "Talk to you later",
    "I'll see you soon",
    "Until next time",
    "Farewell"
  ],
  "subscribe": [
    "I want to sign up for traffic alerts",  
    "Can I subscribe for traffic updates?",  
    "I'm interested in receiving traffic alerts",  
    "I'd like to be informed of traffic updates",  
    "I want to receive traffic notifications",  
    "Can you add me to the traffic alert list?",  
    "I'd like to subscribe for traffic reports",  
    "Can I get traffic updates sent to me?",  
    "I want to be notified of traffic changes",  
    "I'm looking to subscribe for traffic updates",
    "subsribe me for traffic alerts",
    "Sign me up for traffic notifications",
    "Keep me informed of traffic updates",
    "Notify me of traffic changes",
    "Add me to the traffic alert list",
    "Subscribe me for real-time traffic reports",
    "Include me in the traffic update subscriber list",
    "Update me on traffic conditions",
    "Give me traffic alerts on a regular basis",
    "subcribe me for traffic updates"
  ],
  "unsubscribe": [
    "Opt-out of traffic alerts", 
    "Remove me from traffic notifications", 
    "Take me off the traffic alert list", 
    "Unsubscribe me from traffic updates", 
    "Stop sending me traffic notifications", 
    "Deactivate traffic alerts for me", 
    "I no longer want to receive traffic alerts", 
    "Cancel my traffic alert subscription", 
    "Don't send me traffic notifications anymore", 
    "Turn off traffic alerts for my account",
    "I would like to unsubscribe from traffic alerts",
    "Please remove me from the traffic notification list",
    "I don't want to receive traffic updates anymore",
    "Stop sending me traffic alerts",
    "I don't need traffic notifications anymore",
    "I want to opt out of traffic updates",
    "I no longer require traffic notifications",
    "I am no longer interested in traffic updates"
  ],
  "traffic_alert": [
    "What's the latest on the roads?",
    "Send me traffic updates", 
    "Let me know of traffic situations",
    "Can you give me an update on traffic conditions?", 
    "Is there anything I should know before I hit the road?", 
    "What's the current traffic situation?", 
    "Can you give me the latest traffic alerts?", 
    "What are the latest traffic updates?", 
    "Is there any congestion on the roads right now?", 
    "Can you tell me if there's any traffic?", 
    "Do you have any information on the traffic conditions?", 
    "Are there any delays on the roads?", 
    "What's the status of the traffic?", 
    "Can you provide me with the latest traffic reports?", 
    "Do you have any information on the current traffic?", 
    "What's the current status of the roads?", 
    "Can you give me an update on the traffic flow?", 
    "Are there any accidents causing delays?", 
    "What's the traffic like right now?", 
    "Can you give me the latest traffic news?", 
    "What are the current road conditions?", 
    "Are there any issues on the roads at the moment?", 
    "Can you give me an update on the traffic situation?", 
    "Is there any major traffic?", 
    "Can you provide me with the latest traffic updates?", 
    "What's the current state of the roads?", 
    "Do you have any information on the traffic flow?", 
    "What's the latest traffic report?", 
    "Can you give me an update on the current traffic conditions?", 
    "Is there any heavy traffic at the moment?", 
    "What are the latest traffic alerts?"
  ],
  "traffic_report": [
      "I need to report a road issue.",
      "There's a problem with the road I need to report.",
      "Can you help me report a road issue?",
      "The road needs attention, can you help me report it?",
      "I want to bring to your attention a road problem.",
      "Can you assist me in reporting a road issue?",
      "I have a road concern I'd like to report.",
      "Can I report a road problem?",
      "I need help reporting a road issue.",
      "I'd like to report a problem with the road.",
      "There's sand obstructing the road.",
      "The road is obstructed by mud.",
      "A portion of the road is covered in debris.",
      "An obstacle of sand is in the way.",
      "The road is impassable due to mud.",
      "Debris is preventing cars from passing through.",
      "The road has become hazardous due to sand.",
      "Vehicles are unable to get through due to mud.",
      "The road is blocked by a buildup of debris.",
      "Travel on the road is disrupted by sand.",
      "I want to report an issue that happened on the road",
      "The incident occured at my house on the road",
      "It was at main street",
      "My neighbour blocked the road with sand and no vehicle can pass through the street",
      "here is an image of the incident",
      "The incident took place on Main street near courts, there is a big truck block the road",
      "i want to make a report",
      "here is an image of the incident",
      "The location of the incident is",
      "Yes, the information provided is correct.",
      "I confirm that the information provided is true in its entirety.",
      "There is a big truck unloading sand in the middle of the road in Melanie Damishana.",
      "The driver unloaded the sand even though I told him not to",
      "They told me that they would remove the sand before the day is out but its been three days and the sand is still there.",
      "I wish to create a report.",
      "I need to generate a report.",
      "I plan to make a report.",
      "Creating a report is my intention.",
      "I would like to compile a report.",
      "I desire to make a report.",
      "It's my goal to generate a report.",
      "I am aiming to create a report.",
      "My objective is to produce a report.",
      "I am interested in making a report.",
      "I need to report an incident",
      "There's something I need to report",
      "Can I report an incident?",
      "I'd like to report an incident",
      "I have an incident to report",
      "Something happened and I need to report it",
      "Is there a way to report an incident?",
      "I want to file an incident report",
      "There's been an incident that needs reporting",
      "It's important that I report an incident",
      "I was driving on the highway when I saw a car swerve off the road and crash into a ditch. The incident happened just before the exit to the downtown area. The car looked badly damaged and the driver seemed unconscious. I immediately called the emergency services and reported the incident, giving them the exact location and a detailed description of the scene.",
      "I was walking on the sidewalk when I saw a cyclist get hit by a car at the intersection of 5th and Main. The incident looked serious and the cyclist was injured. I called 911 and reported the incident, providing the location and a detailed description of the scene. The emergency services arrived shortly after and provided medical attention to the cyclist.",
      "I was driving home from work when I noticed a pothole in the middle of the road. The pothole was quite large and could cause an accident if a car hits it. I decided to make a report about it and contacted the local authorities. I provided them with the location and a detailed description of the pothole, hoping that they will fix it as soon as possible.",
      "I was on my way to a meeting when I saw a truck with a broken axle blocking the entire road. The incident happened near the downtown area, causing a major traffic jam. I called the emergency services and reported the incident, providing the location and a detailed description of the scene. The local authorities arrived shortly after and cleared the road for traffic.",
      "I was riding my bike when I noticed a group of kids throwing rocks at passing cars. The incident happened near the park, and it could cause damage to the cars or injure someone. I decided to make a report and contacted the local authorities, providing them with the location and a detailed description of the scene. The police arrived shortly after and dealt with the situation.",
      "I was walking my dog when I saw a car with a flat tire on the side of the road. The incident happened on the highway, and the car was parked in a dangerous spot. I decided to make a report about it and contacted the emergency services. I provided them with the location and a detailed description of the scene, hoping that they will assist the driver as soon as possible.",
      "I was on my way to the grocery store when I saw a car with a broken taillight on the side of the road. The incident happened near the busy intersection, and the broken taillight could cause an accident if someone hits the car from behind. I decided to make a report about it and contacted the local authorities, providing them with the location and a detailed description of the scene.",
      "I was driving to work when I noticed a car parked in a no-parking zone. The incident happened near the office building, and the car was causing inconvenience to other drivers. I decided to make a report and contacted the local authorities, providing them with the location and a detailed description of the scene. The local authorities arrived shortly after and took action against the violator.",
      "I was on my way to the gym when I saw a pedestrian jaywalking across a busy road. The incident was near the downtown area, and the pedestrian was risking their life crossing the road without using the pedestrian crossing. I decided to make a report about it and contacted the local authorities, providing them with the location and a detailed description of the scene.",
      "I was driving on the highway when I saw a car with a broken windshield driving in the opposite direction. The incident happened near the exit to the industrial area, and the broken windshield could obscure the driver's view and cause an accident. I decided to make a report about"
  ],
  "cancellation": [
    "I request to retract my report.",
    "I'm looking to withdraw my report.",
    "Can I undo my report, please?",
    "I'd like to eliminate my report.",
    "Could you help me cancel my report?",
    "I need to void my report.",
    "I'd like to annul my report.",
    "Can I have my report cancelled, please?",
    "I want to repeal my report.",
    "Could you arrange for my report to be cancelled?"
  ],
  "status": [
    "I'd like to see where my report stands",    
    "Can you tell me the status of my report?",    
    "I'm interested in checking the status of my report",    
    "I want an update on my report",    
    "Can you give me a status update on my report?",    
    "I'm curious about the status of my report",    
    "I need to know the status of my report",    
    "Can you provide information on the status of my report?",    
    "I want to know if there have been any updates on my report",    
    "I'm looking for information on the status of my report"
  ]
}
