[
  "The incident took place on [main street](location).",    
  "This event took place at [Robb Street](location).",    
  "This incident was at [Orange walk](location).",    
  "The situation arose at [sheriff street](location).",    
  "The disturbance was observed on the [Linden Highway](location).",    
  "The mishap happened at [Melanie Damishana](location).",    
  "The entire [main street](location) was blocked yesterday.",    
  "The crisis occured [alexander street](location).",    
  "The disruptionoccured at [east bank](location).",    
  "I want to report an issue about the road that happened at [main street](location).",
  "The case number associated with my report is [CASE469](case_number).",
  "My report is linked to case number [CASE469](case_number).",
  "I have a case number for my report, which is [CASE469](case_number).",
  "[CASE469](case_number) is the case number for my report.",
  "My case ID is [CASE469](case_number).",
  "I'm interested in the status of the report with the case number [CASE456](case_number).",
  "I'm looking for information about the report with the case number [CASE456](case_number).",
  "Can you provide me with the status of the report linked to case number [CASE456](case_number)?",
  "I would like to know the current status of the report with the case number [CASE456](case_number).",
  "I'm trying to find out the status of the report with the case number [CASE456](case_number).",
  "I would like to cancel my report, which is associated with case number [CASE345](case_number).",
  "Can you cancel the report with the case number [CASE345](case_number) that I submitted?",
  "I want to cancel my report, and the case number for it is [CASE345](case_number).",
  "The report that I want to cancel has the case number [CASE345](case_number).",
  "I have a report with the case number [CASE345](case_number) that I would like to cancel.",
  "I'm wondering about the current status of my report with the case number [CASE40](case_number).",
  "Can you provide me with an update on the report associated with the case number [CASE40](case_number)?",
  "I have a report with the case number [CASE40](case_number) and would like to know its status.",
  "What's the status of the report linked to the case number [CASE40](case_number)?",
  "I'm trying to find out the status of my report, and the case number is [CASE40](case_number).",
  "Can you cancel the report linked to the case number [CASE456](case_number)?",
  "I would like to cancel the report that has the case number [CASE456](case_number).",
  "My report has the case number [CASE456](case_number), and I want to cancel it.",
  "Could you cancel the report with the case number [CASE456](case_number)?",
  "I have a report with the case number [CASE456](case_number) that I want to cancel."
]
