["[Humor](emotion) is a really great medium to remove boredom and to start a nice and easy conversation anywhere anytime. Nothing can make you laugh like sharing a few hilarious jokes with your closest [friends](people). Here we present you a wide collection of funny messages for [friends](people) that you can post on Facebook or Whatsapp to [cheer](emotion) them up and make their day shine brighter.", "I went to the [Drake](people) concert the other day, I had a lot [fun](emotion)! There was a huge crowd towards the front just jamming to his music. I felt kinda claustrophobic so I moved to the back. The concert lasted 2-3 hours and he played all his classic hits.I met some of my [friends](people) from college there, and we decided to go and grab some food after the concert at a local pizza shop. Overall, I had a great time it was definitely worth going.", "I just finished my 2nd dose of Radiation for my cancer [today](date).  It was nerve racking but it went a lot quicker than my appointment [last Friday](date).   For the 2nd appointment it takes longer to get angled on the table correctly versus how long the actual radiation treatment takes so that was a plus at least.", "I went [skydiving](event). I jumped from [3000 feet](height) and was in the air for half an hour and then landed on the [beach](landed). it was [wonderful](emotion)", "I went to [Delaware](location) to visit [my mother](people), [sisters](people), [brother-in-law](people), [nieces](people), and [nephews](people). It was a pleasant [trip](event). I [enjoyed](emotion) their company. The take out food was [tasty](taste). I hope to go again soon.", "[MY SISTER](subject)  [BIRTHDAY](event) IS COMING SOON  YOU WILL COME ATTEND THE PART", "I went to this [amazing](emotion) [party](event) [last night](date), and I just had to tell you all about it! The party was held at this really cool [rooftop bar](location) [downtown](location). When I got there, the atmosphere was buzzing with [excitement](emotion). The music was fantastic, and there was an incredible view of the city skyline. I bumped into a lot of [old friends](people) and made some new ones too. We [danced](activity) the night away, and it was just such a [blast](emotion)! I felt so [happy](emotion) and [energized](emotion). It was one of the [best nights](emotion) I've had in a long time.", "i hope you are doing great. I'm writing to tell you about an event i attended  in [India](location), it was an [exhibition](event) . There were people from all all over the country selling traditional goods like clothes and bags they are of superior quality nal goods  like handbags ,clothes, and many more.can you believe  everything is of nal goods like handbags ,clothes,footweargoods  likenal goods like handbags ,clothes,footwear", "I AM GONNA SHARE A [BEAUTIFUL](emotion) AND LONG LASTING MEMORY THAT ALWAYS MADE ME FELT [HAPPIER](emotion), IT WAS A [MARATHON](activity) AND THIS WAS A FIRST TIME EXPERIENCE ALONG WITH MY [FAMILY MEMBERS](people) AND [FRIENDS](people) AND ACTUALLY I WAS THE LAST PERSON TO COMPLETE THE RACE AND EVERYONE OVER IN THE CROWD CHEERED ME A LOT AND THAT MOMENT MADE FEEL LIKE SOMETHING I WAS SO [SPECIAL](emotion) THERE IS NOTHING IN WINNING OR LOSING A GAME ALL IS THAT PARTICIPATION IS IMPORTANT AND I REALLY [LOVED](emotion) THAT A LOT.", "[last monday](date), i was at [work](event), when my [boss](people) asked to set up an afternoon meeting with some [suppliers](people) and asked to put a table with breakfast for the participants, but i [completely forgot](emotion) to do it and when the day of the meeting arrived, there was nothing for them to eat, my [boss](people) came to ask me why there was no food on the table, and said that I [forgot](emotion), I felt [very embarrassed](emotion) and ran to the nearest [bakery](location) and bought what was there to serve.", "i went to the [store](location) [yesterday](date) and i [hated](emotion) it. I feel [awkward](emotion) being around people since i have a service dog people constantly [stare and make comments](emotion). such a simple task takes so much out of me that i am [mentally drained](emotion) at the end.", "[Last Saturday](date) [Josh](people) and [Rachel](people) were [married](event), many of their [close friends](people) and [family](people) were there. The venue was [beautifully](emotion) decorated with a rustic theme. [Josh](people)'s best man [Jacob](people)'s speech was the most [humorous](emotion) speech I have heard yet but I'm assuming the alcohol had a lot to do with that. [Chelsea](people), [Rachel](people)'s maid of honor had a speech truly from the heart mentioning past details they shared together and how [Josh](people) and [Rachel](people) met. This day was [magical](emotion) to say the least and made me feel [excited](emotion) for my own wedding one day.", "Dear [friend](people), Gone are the days of laughing, talking, [singing](activity) and [celebrating](activity). I feel [sad](emotion) about it and I want those memories to come back.", "You should come to the [farmers market](location). It is a great place to get the freshest local produce!", "The other day someone at [work](location) was [fighting](activity). It was [crazy](emotion). There was a big crowd and everyone was [yelling](emotion) and [cheering](emotion). They had to walk the people out.", "I just went to a [park-based](location) [outdoor music festival](event). The celebration of the summer's conclusion took place at this amazing event. The attitude was [upbeat](emotion) and [energizing](emotion), and the weather was [ideal](weather).The [park](location) had numerous [stages](location) set up with various bands and performers performing music from various genres. The music on the schedule ranged from jazz and reggae to rock and pop. The bands were all really [talented](emotion) and [energetic](emotion), and the sound quality was [fantastic](emotion).  There were a lot of people in the [park](location), and they were all having a [fantastic](emotion) time. There was a sense of community and camaraderie among those present as they [danced](activity), [sang](activity), and listened to the music together. It was so [enjoyable](emotion) and [welcoming](emotion).", "Recently, I helped put together a [portfolio showcase](activity) for local creatives in my [city](location). It was a [lot of work](emotion), but the event itself went well. It was at a [beautiful](emotion) event space [downtown](location), and many people came. I sat at the front and helped sign people in.", "Went to a Home Free [concert](event).  It was on [Sunday](date), [February 19th](date) at 7 pm.  I had a [wonderful](emotion) time. Home Free is a group that [sings](active) with out back ground instruments or music.  They performed great.  It was a [nice atmosphere](weather) and we had [terrific](emotion) seats.  I want to go again", "I would tell my [friend](people) that I missed her coming to visit me when I was in the [hospital](location) because I missed her presents and was very [lonely](emotion) there.", "The [birthday](even) party was organized completely with the F. R.I.E.N.D.S theme. I really [enjoy](emotion) there and everything went according to my plan.", "I went to the [town fair](location) the summer and the smell of funnel cakes made me want to buy a dozen. They were lights from all the [games](activity) being played and the sounds of people [laughing](emotion) and having a [good time](emotion). When I finally bought that funnel cake it was [heavenly](emotion) it melted in my mouth.", "I had an [amazing time](emotion) at the event [yesterday](date)! The atmosphere was so [vibrant](emotion) and [energetic](emotion), and it was so much [fun](emotion) to be surrounded by so many people who were all [enjoying](emotion) the same thing. I met some great people and made some new [friends](people), too. I was really [impressed](emotion) with how well-organized the whole event was and how everyone was so [friendly](emotion) and [welcoming](emotion). I'm so [glad](emotion) I decided to go, and I can't wait to do it again!", "Hello [Jonathan](people), I was in the [forest](location) [today](date) and discovered a high ropes course. There you can climb from one tree to another at a height of 15 meters and then abseil down.", "Recently I attended a 'Gala' [Dinner](event) in the [Pegasus Ballroom](located) at the [University of Central Florida](location). This event was advertised to the entire [student](people) population in the weeks prior to this event. Around 700 people showed up to this [dinner](event) with a majority of the people wearing a nice button down with dress pants. The women wore long dresses and/or fancy dresses you would see actresses wear at the red carpet. The meal started off with a serving of [bread](food) and various dips which included, [guacomole](food), [hummus](food), and more. After the bread we were given salads. Soon after was the main meal which consisted of ground beef mixed together with white jasmine rife and a side of cooked squash and zucchini. Once everyone was done getting their food, the speeches occurred. The speeches were given by all of the running parties for the upcoming presidental election. After the speeches were over people decided to get [dessert](food), which was [chochalte](food) [cake](food), or decided to leave.", "[Last week](date) I went to NYC to visit my [granddaughter](people) on her [sixth](age) [birthday](event). We had a [cake](food) and some [Dominican food](food). We gave her gifts. We stayed over in a [hotel](location). We had breakfast and left in the morning. It was a [fun](emotion) [trip](vacation).", "I attended [Jay](people)'s [funeral](event) in [California](location) [last weekend](date). The turnout was [amazing](emotion), so much more support than we expected. It was [amazing](emotion) to see the huge impact [Jay](people) made on his community.", "I went to a [friends](people) [engagement](event) party [yesterday](date). I hadn't gotten to see her in a while, so it was [nice](emotion) to see her looking so well. She looked [happy](emotion) which made me happy. There was great food and music too.", "I went to [my son](people)'s [basketball tournament](event) game. It was a [good](emotion) game early on but got out of hand by the end. The opposing team was not very good and [my son](people)'s team was not challenged by them. [My son](people)'s team won the game by 20 points and advanced to the next level.", "I went to the [bar](location) last night and it was so [fun](emotion). We had a whole lot of drinks and after that we went out to eat i had a [burger](food) and some [fries](food). It was so [good](emotion).", "going to a [concert](event) had just [rained](weather) and there in the mud in the field with 180000 people, we shouted the song that most of all we shared. Its a feeling of union and [fantastic beauty](emotion)", "A [birthday party](event), and a vacation to a [tropical island](location) looks [fun](emotion)!", "[HAPPY](emotion)", "I remember the first time i was holding my [son](people) in my arms after giving birth to him. He felt so warm and comfortable. That day was one of the [happiest](emotion) days of my life. His [father](people) was beside me the whole time, God rest his soul.", "i am so [blessed](emotion) to have this beautiful [baby](people).", "I have a [little daughter](people). I still remember the day she was born.", "It remembers one of my [friend's](people) [birthday](event) celebration", "It makes me remember the day my [daughter](people) was born", "This photograph was taken when my [first granddaughter](people) was born.  My daughter was so [happy](emotion) and my [son-in-law](people) was [thrilled](emotion).  The baby, of course, was perfect.", "I took a [hike](activity) in the jungles in [Mexico](location) and it was so beautiful", "This [beach](location) vacation with my [besties](people) was [amazing](emotion)!!  We had so much [fun](emotion) and [enjoyed](emotion) every day!!  We basically lived on the beach the [entire week](date).  Well, except for the day it was [stormy](weather).  That day was kind of scary but we just stayed in and played poker.  This was the best vacation EVER!!", "I have gone vacation with my [friends](people) which is unforgettable. We planned going [Andaman](event) which is a Island we traveled through boat and spend 3 days there having [fun](emotion).", "Last we all [friends](people) celebrate one of our friend's [birthday](event) in a [restaurant](location).  There is lot of [fun](emotion), dance, music, cake.  we all [enjoyed](emotion) it.", "The day I got to meet my [friends](people) new [baby](people) was one of the [happiest](emotion) of my life! My [friend](people) and [her husband](people) were holding little [baby Layla](people) when I visited the [hospital](location) and they both looked like they were simply glowing with [joy](emotion).", "The day I had my baby was the [happiest](emotion) day of my life. It will forever be my most [favorite](emotion) day. After hours of labor and a [tough](emotion) birth I took one look at my [baby](people) and it was all worth it. I was so [happy](emotion) my [husband](people) was by my side the entire time. He is going to make such a great [daddy](people)!", "We all had an [amazing](emotion) time at the party. Everybody socialized, we played [party games](actvity), [danced](actvity) and had a lot of [fun](emotion) throughout the evening. The best part was the fact that everyone was [happy](emotion) with the celebration and there were smiles all around me.", "when I began working for my current workplace. My [happiness](emotion) cannot be expressed in words. I had to undergo a number of exams to prove my suitability for the role because there has been fierce competition for jobs at that company. I finally discussed the subject with my [coworkers](people) and then we had a group discussion. They teased me with considerable [excitement](emotion) when they revealed my resultsthat I had been hired. I'm so ecstatic that I'm at a loss for words. I said thank you to my commander.", "Myself and [my wife](people) posing just after the birth of our [first child](people). A wonderful memory.", "It makes me remember the day when my [daughter](people) was born", "The birth of my [first child](people) was a moment that I will never forget. It was a moment of pure [joy](emotion) and [excitement](emotion), but it also came with a lot of [fear](emotion) and [uncertainty](emotion). [My husband](people) was by my side throughout the entire process, providing me with the support and comfort I needed during this special time. As we welcomed our little bundle of [joy](emotion) into the world, I knew that everything would be alright.", "i [enjoyed](emotion) more with my [friends](people) by visiting more places", "I was [hiking](activity) alone through this forest recently. It was an [amazing](emotion) experience. I could see so many different things and I felt calm and centered like you would never believe.", "I had a different experience when i first got my baby after so much [trouble](emotion) . My hubby was also very [happy](emotion)..", "The [birthday](event) is unforgettable moments. [Friends](people) made a day much more [thrilling](emotion).The cake is so tasty. Decoration also impressed.", "I had a great time with my [friends](people) at a [private beach](location)!", "This memory is from a time when I was on vacation with some [friends](people). We spent the day at the [beach](location) and it was a lot of [fun](emotion). We [swam](activity), played in the sand, and hung out in the hammock. It was a great day and I [enjoyed](emotion) spending time with my [friends](people).", "How can I forget the day my [son](people) was born? The most beautiful thing in the world happened, the miracle of life presented itself before my eyes.", "i had celebrated in my [birthday](event) and special to outing some places natural sea and forest for longing to enjoy in my [family](people) also together well settled", "My [happiest](emotion) times are spent surrounding myself with people and places I love.", "A beautiful day at the [beach](location). Beautiful weather. Beautiful [friends](people).", "I [enjoyed](emotion) a [beach](location) vacation with a group of [friends](people). It was [pleasant](emotion) to be together.", "So [excited](emotion) about the birth of our [baby girl](people), it's been a long 9 months but it's so worth it to finally be able to hold her in our arms! Welcome to the world!", "Do you remember our vacation in the [Amazon rainforest](location)?", "Oh wow, I remember this photo! It was taken at our [friend's](people) [birthday](event) party, right? I can see us all smiling and having a [great](emotion) time. I remember how much [fun](emotion) we had that day, [playing games](activity), eating cake, and just enjoying each other's company. Our [friend](people) looked so [happy](emotion) and it was such a special moment. Looking back at this photo really brings back fond memories of that day.", "The birth of our first [child](people) what an [amazing](emotion) event in our lives.", "It was one of the best [birthday](event) surprises I ever had. Everyone had those paper hats, there was confetti, nicely wrapped gifts and I even received a small cake that had 28 candles. The best part is that it was a small party with only my closest [friends](people) and nobody else. Nothing could have made that [birthday](event) [surprise](emotion) any better.", "a holiday [trip](event) on an island, both the weather and the water is [warm](weather), also celebrating graduating from college. The feeling is freedom, and reset. Advancing to a new phase, career and all. And a lot of hope.", "my first birth [child](people) very cute day that i dont forgot it  day  because my cute little prnice [daughter](person) produce day", "I remember the first day my [baby](people) was born. It was so wonderful to finally hold you in my arms after 9 months!", "I'm Very Surprised of my 23rd [birthday](event) celebration done by my [friends](people) in our college. Its an unforgetable day in my college days.", "i think i like it all photos and also this photos is related to my life and most important one is fourth photo bring to my old memories. because i remember in my beautiful days in my [child](people) birth and i will blessed to my have my [child](people).", "I will never forget the day my [friends](people) and I traveled to the [coast](location) and [enjoyed](emotion) the [beach](location), food and good company.", "I [love](emotion) my [family](people) very much, becausethey are my world. and i will always strive for the my familys [happiness](emotion) throughout my life.", "I would say that giving birth to my [baby](people) was the best and most connecting moment of my relationship with my [husband](people).", "I totally remember being there with my [mother](people) and [aunts](people) and my [grandfather](people). I remember seeing us all at the table. That's how I know for a fact that my [mother](people) admitted to having an affair with my [uncle](people).", "I remember back in the good ol' days I used to go out with my [friends](people) and [classmates](people) to a [restaurant](location) to get some [drinks](activity) after school. Its mostly in [Fridays](date) as we will have more time to [enjoy](emotion) without [worrying](emotion) about homeworks. We used to go all arround the town enjoying the time and have some fun [playing video games](activity) in the [arcade](location). We return home mostly at 18:30 after all the [fun](emotion) we had.", "There was this one time that I was in second grade. I remember being there with my [friend](people) Zach and Matt and we were coloring. Then, we thought it would be a great idea to see if we could smell the color of the crayons by putting them up our nose. I got a purple crayon stuck so far up my nose that I had to go to the school nurse. It was very embarrassing.", "[Tom](people), remember how you used to have to run a sump pump to keep from flooding your basement?  You finally figured out that the feed pipe from the water supply was leaking.", "I remember going to [Cantigny park](location) with my [husband's family](people) [2 years ago](date) and having a grill out. I remember we all drove separately and met up in the [parking lot](location). I remember my [husband](people) and I leaving to go explore right away so that he would not be stuck [grilling](activity) all day.", "I was asleep in the room I shared with my [brother](people) when the phone in the hallway rang at around 6 in the morning. I heard my [father](people) say Okay, thank you, I think you have some blankets we'll have to come get. My [grandmother](people) had [died](event) in the [health facility](location) she had been in.", "This [morning](date) while about to leave home, [Peter](people) gave me flowers and kissed me. I was stuck in [surprise](emotion) later I realized that it was our [anniversary](event) [today](date) which I totally forgot.", "One time I went [biking](activity) with my [dad](people) on a trail along the [Delaware River](location). It was really nice, like the scenery was pretty and there was some cool stuff to see. We got to the end of the trail and had lunch. We had turkey sandwiches and peanut M&Ms. We sat on a bench in the shade and talked about the ride and life things. Then we rode back and stopped at a farmers market. I got a brownie and it was so good. I also got gummy coke bottles to take home. It was a nice treat to look forward to. Then we rode back to the car and came home. It was a nice day.", "Remember that one time when we were in [gym class](location) and after they done roll call we jetted out the back door to go to [McDonalds](location) and get [McFlurries](location)? [Fun](emotion) times.", "Once I used to go to [library](location) often. I was a [pleasant](emotion) memories. I had lot of experience regarding the various books and authors.", "i think and i start conversation with my [friend](people) told something in our [school](location) incident to prove my memory skills.", "I am documentating the last time we hung out together. I was really [sad] in a bad place and so [happy](emotion) to hang out with them. We ate ramen noodles at their house, [watched some YouTube](activity), played a Japanese horror [video game](activity), and [hung out](activity). This memory was with my best friend, [Ray](people).", "It was a [good](emotion) time when we were together", "I always wanted to share with you how I lost my [first love](people), which is still a [bad](emotion) memory in my life.  It was almost [24 years back](date) when I met him and we were like very close to each other, but suddenly one fine day there was no news of him, it was the time where there were no mobile phones of use in my country and so I could not able to contact him as he was staying [college hostel](location) and gone to his native place.  After about one week, the news came that he died in an accident in his own village and as no one know about our love, I could not express my feeling and I just ground it in my heart. Till now, this has been both [good](emotion) and [bad](emotion) memory of mine.", "[Friday](date) I went to the [supermarket](location) with my [daughter](people) and we met our [neighbors](people) in the [parking lot](location).", "[Michael](people), [Jason](people) and me went to the [park](location) [yesterday](date). It was our memorable day. The [park](location) was full of water games, 3-D theatres, etc.,", "I recall going on [Aida cruises](location) with [Oana](people). We had a [wonderful](emotion) time but it always stuck with me just how weird it was to be on a [cruise ship](location) where almost everyone spoke German. What [surprised](emotion) me was that they had [smoking areas](location) everywhere, even in some interior spaces. This is something that I do not remember seeing on any other cruise ship.", "I went to [Disney World](location) with my [son](people), [daughter](people) and [their dad](people).", "I was with my [wife](people) when I remembered how I was lost in the [Caymans](location) for a retreat...", "[Mario](people) do you remember when we [ate](activity) pizza near the [port](location)", "I remember this time we went to the [concert](event) at that [venue](location) for the first time.  I was [surprised](emotion) at how organized and clean the [concert hall](location) was.  It was so [fun](emotion) and easy to get to and get out of.", "then i went to the [hospiital](location) wih [sam](people) while you stayed at the [wedding](event)", "The [woman](people) in the [park](location) screamed so loudly that i was [shocked](emotion) for a moment.", "Do you remember when we took the [boys](people) to the [aquarium](location) and [Ari](people) made me [buy](activity) [him](people) and owl and a rabbit and he named them Hoots and Hops? We went to [dinner](event) at the [crab shack](location) after and he introduced them to the entire [restaurant](location).", "When I went to [Sikkim](location), I shared with my [friend](people) the memories we have about how much [fun](emotion) we had on the [trip](event).", "[Last Saturday](date), I went with my [husband](people) and my pet dog to play at the [carnival](event) in [rio de janeiro](location), we went to the [beach](location) and [ate](activity) fried fish.", "Ive known my two best [friends](people) since 9th grade. In that time, a lot has happened, and Ive forgotten a lot of it. Its not unusual now for one of them to say Remember in [high school](location), when this happened? and for me to reply Well now I do. Theyre always reminding me of things Ive forgotten. Theyre an extra hard drive for my limited memory capacity.", "[we](people) were going the [zoo](location) and find a [cute girl](people)", "Remember the time we went [skiing](activity)?", "how is it possible we everything is gone  you and me [playing](activity) hide and seek and another  games are was strongly capture in my eyes miss you so much [alex](people)", "I was at a [music festival](event) with my [friends](people) and we were having the time of our lives. We were [dancing](activity) and [singing](activity) to all of our favorite songs and it felt like nothing could bring us down.", "I remember the day vividly. I was surrounded by my [friends](people), and we were all [laughing](activity) and [joking](activity) around. We were down at the [beach](location), soaking in the [sun](weather) and the smell of the salty waves. The conversation flowed effortlessly like a river and the sound of our laughter filled the air. We were carefree and nothing else mattered in that moment. It was truly a day to remember.", "in friendship day we went for [tourist places](location) i captured that places  in my phone", "I had lunch [yesterday](date) with my with. We planned our [trip](event) to [Maine](location) for her [birthday](event).", "Growing up, I had a very [loving](emotion) [family](people). I had [three siblings](people) with whom I used to [play](activity) a lot. I remember very fondly the games we use to play. Especially, in the [evenings](date), we used to go out in the [park](location) with our sports equipment. Each day we [played](activity) different games, for example, football on one day and cricket on the other. These memories of [playing](activity) in the [park](location) are very dear to me.  Furthermore, I remember clearly the aroma of my [grandmothers](people) pickles. I used to help her whenever she made pickles. We used to watch her do the magic of combining the oils and spices to make delicious pickles. Even [today](date), I can sometimes smell her pickles whenever I look back at this memory.  Most importantly, I remember this instance very clearly when we went out for a [picnic](event) with my [family](people). We paid a visit to the [zoo](location) and had an [incredible](emotion) day. My [mother](people) packed delectable dishes which we [ate](activity) in the [zoo](location). My [father](people) clicked so many pictures that day. When I look at these pictures, the memory is so clear, it seems like it happened just yesterday. Thus, my childhood memories are very dear to me and make me smile when I feel low.", "My first backpacking [trip](event) was alone in the [Sierra Nevada Mountains](location).", "Your recent win reminded me of one of the [luckiest](emotion) days I experienced in the [casino](location). I hadn't planned on [gambling](activity) [that weekend](date) since the drive to [Nevada](location) is a bit far from [Salt Lake](location) but I just had a feeling and felt [lucky](emotion). So I headed out and on the drive I began to imagine which [casino](location) I would start at and what machine I wanted to try. Once I arrived I was heading to a favorite penny machine and for some reason I shifted my attention and made a beeline to the Megabucks machine. I put in my $21 and on the first pull I got three gold 7's which gave me over $500! I was amazed! First machine, first pull and a big win. I left shortly after to keep my winnings.", "[Yesterday](date) [Andrew](people) and I ran 10 miles on the [Neuse River Trail](location). After the 8th mile, I swore I was never [running](activity) again. By the 8th mile, he was thinking we'd need to cut back to 8 in our [last week](date). So he was a little more optimistic as usual.", "I remember the day my first [daughter](people) was born. My [husband](people) was with me. It was [wonderful](emotion). I remember it fondly.", "i gone one place with my [friend](people) i was very [happy](emotion)", "once in my [school](location) annual day my [friends](people) and my self was [eating](activity) snacks and we were [chatting](activity) together  it was [amazing](emotion) day. after my performance we all [played](activity) hid and seek games", "i love  my friend [ashlin](people).", "ones upon a time i forgot my keys on my table but i got some other day", "I remember the day I went on my first [date](event) with [Bill](people). We met at a [Pizza Hut](location). He was wearing black jeans and a white dress shirt. He seemed sweet and shy. I believe an arrow went through my heart and we were engaged [two months later](date). [Best](emotion) blind date eve!", "AS A [FRIEND](people) IN A FIRST MEETING IN OUR [SCHOOL](location) DAYS ARE AMAZING OLD DAYS BECOME TRULY WORTH FOR IT", "My [child](people) is very smart. he is very active. [yesterday](date) he was a [cold](weather) . but today is [good](emotion).", "I got to [enjoy](emotion) my [wedding](event) day with all my [family](people) and close [friends](people)!", "omg girl do you remember that time [Jarred](people) you and I had drinks at [margaritaville](location) to celebrate his new car?  He was so [excited](emotion) about his major accomplishment that he wants to share the moment with us! What a [fun](emotion) day!", "It was a very [bad](emotion) [incident](event) in which na very difficult Patton.", "We were at the [marriage](event) party [last week](date) with our [family](people).", "Can you remember when we first met? It was a [cold](weather) day in [November](date), there was [snow](weather) falling and settling in the [garden](location). I imagine it was [frightening](emotion) to behold as somebody of advanced years. Those were the days.", "So we went [camping](activity), [scott](people), the [kids](people) and I. We get there after [driving](activity) a few hours. We were stuck in traffic forever. When we finally get there, we start setting up the tent and making a fire when it just starts pouring on us. The tent was not all the way set up yet so we all had to go and get back in the car for another two hours while we waited for the [rain](weather) to pass. Next time we go [camping](activity) I have to check the weather beforehand. At least Iearned my lesson and we had a blast that weekend after the [rain](weather) finally passed.", "When I was about six years old, I remember going to the [lake](location) [every weekend](date) with my [grandparents](people). The strangest part is that the things I remember the most are the gritty sand, the soggy sandwiches, the lukewarm drinks, and my [every weekend](people) holding up a blanket for us to use the bathroom behind.", "I remember when me and my wife [Kris](people) were at [Disney](location) on the earthquake ride, and my [son](people) was [screaming](emotion) bloody murder. [Jake](people) was about three, and just kept [screaming](emotion) his head off even though the ride was not really scary. The people around us were super annoyed, some people made comments. Man, that was [embarrassing](emotion).", "I went [hiking](activity) with my [family](people) during the break.", "In the fall, my [cousin](people) and I went to [Disneyland Park](location).", "[Few days ago](date) I visited the recently organized [State Expo](location) with my [mother](people) and my [aunty](people).", "I remember being young and we always kept busy one way or another.  I remember just [sitting](activity) around in the [shed](location) with gisele , lou , rose and I and just [laughing](activity) and [hanging](activity) out.  We always had so much [fun](emotion) growing up.", "I went to the nearby [park](location) [last week](date) with [John](people) and [Adam](people), and we [enjoyed](emotion) ourselves, as the weather was [fantastic](emotion) that day!", "Hey, do you remember that time when we went [camping](activity) in the [mountains](location) with [Sarah](people) and [John](people)? It was such an [amazing](emotion) experience! We [hiked](activity) up to the top of the [mountain](location) and watched the sunset while we cooked hot dogs over the campfire. Then we stayed up late telling ghost stories and [listening](activity) to the sounds of the wilderness around us. The next day, we went [fishing](activity) and caught a bunch of trout for [dinner](event). I'll never forget how [peaceful](emotion) and [rejuvenating](emotion) that [trip](event) was.", "Remember the [hockey](event) game against Central Catholic Junior Year? I got a goal, [McCrobie](people) got a goal, and [Julien](people) got two assists. We should've won because [Ben Barton](people) got a goal but it got called back. We were that close to winning the DCL.", "[anitha](people) and [punitha](people) are very close [friends](people) in [school](location) days .one day she's are [school](location) life this day teacher's day function in our [school](location) .two [friends](people) in join the function in our zoology sir dance is very comedy,super an this day are memorable day in our [school](location) day.", "I went to the [cinema](location) with [Ed](people) and [Cam](people) and when leaving fell over in front of everyone", "once in my [school](location) annual day my [friends](people) and my self was [eating](activity) snacks. and we were [chatting](activity) together it was [amazing](emotion) a day after our performance we was play hide and seek", "Went to [Alaska](location) with my [husband](people) and caught a king salmon, at the time there were 7 or 8 other boats there and were all filled with men and I was the only one who a salmon.", "Do you remember that time when we built a fort in the woods and then were chased by the old man? We ran so fast and got lost and it took us forever to find our way home.", "I went to the [movies](event) on [Saturday](date), but the movie wasn't that great.", "I was thinking about the time we took the [kids](people) to the [park](location). Do you remember how much [fun](emotion) they had?", "Back when i graduated high [school](location), i was so [afraid](emotion) to walk across the stage. I was six months pregnant and the first in my class to even walk the stage. I just knew what was going on in everyones mind. What they didn't know was that i could have graduated early but i took extra classes. I didn't fail a single class. Man i was proud.", "we were together by my [sisters](people) [wedding](event) when [sam](people) broke his leg", "[Last year](date), my [birthday](event) party was great!  Everyone who was invited came and everyone brought a different dish to sample.  I provided the beverages.  We talked and relived a lot of adventures, trials and tribulations.  By the end of the evening, I believe a [good](emotion) time was had by all.", "I was [diving](activity) in [Mexico](location) with my new [friends](people) I met over there.", "When my [boyfriend](people) and I were living in an [apartment](location), our cat liked to go outside, climb the fence, and jump up to the upstairs neighbor's balcony.", "I was [talking](activity) to my [friend](people) about a memory I was in. We were all at the beach and it was a really hot day. We were all trying to find a place to cool off and we ended up finding this spot under this really big tree. It was really shady and it felt so [good](emotion) against my skin.", "I remember the time I shared this special moment with my [friends](people) - it was so natural and full of [laughter](emotion).", "Dear [friend](people), Gone are the days of [laughing](activity), [talking](activity), [singing](activity) and celebrating. I feel [sad](emotion) about it and I want those memories to come back.", "You would tell your [friends](people) about it, and, on later occasions when you saw a giraffe, you might be reminded of the day you saw one on [campus](location).", "I went to a [grocery store](location) with my [friend](people) [Sarah](people) [last week](date), and it was such a [bizarre](emotion) experience because all the shelves were empty!", "I went to [dinner](event) with my [parents](people) at the new [restaurant](location) that opened on [Saturday](date).", "At a [band competition](event) [Matt](people) and I snuck off to a side stage and found these huge cardboard tubes, so naturally we used them to joust on the stage. Boy that hurt.", "My memory is my [grandmother](people) .... who used to prepare squares of bread for me with raw ham made by my [every weekend](date) [sister](people) and called them the soldiers (I don't know why) or almonds and hazelnuts with sugar in a pan that all caramelized .... my [grandmother](people) who always stood up for me and I miss her so much.", "me and [John](people) were on a [trip](event) to [Dubai](location) and some guys attacked us. We were [kidnapped](activity) and [killed](activity) later", "We were celebrating [John](people)'s [birthday](event) at our really [good](emotion) [friend](people), [Alyssa's house](location).  We always threw parties over there so this wasnt going to be any different than a normal [Wednesday](date) night.  At the time, [John](people) and me were kind of in to the same girl, we did not know who the girl liked back between the two of us.  However, my interest started to go towards someone else named [Crystal](people).   I told [John](people) that he could have Hannah, the girl we were originally both interested in.  So at the [birthday](event) party, [John](people) pulls me to the side and gets really serious with me and I'm [thinking](activity) oh no whats wrong with my best [friend](people) and he tells me dude if you want Hannah you can have her dude. My fave dropped instantly because that was not what i was expecting him to say, it genuinely [surprised](emotion) me and caught me off guard.  Luckily because [John](people) is my best [friend](people) as much as i am his best [friend](people), he saw the emotions run across my face and i never had to defend myself or explain.  He just knew that he was wrong in saying that to me and he was being [insecure](emotion) and had trust issues in the moment.  The trust and loyalty between me and [John](people) has stood the test of many things, and we always prove that i am my brothers keeper", "Remember that time we went to the [dock](location) to go [fishing](activity) Josh? You brought a lot of bait since we always seem to run out at the most inopportune time.", "I walked along the boardwalk in [New Jersey](location) with my [parents](people) and most of my [siblings](people) (I have seven of them). I remember [eating](activity) [fun](emotion) food and seeing carnival attractions and huge beaches. I have the photograph we took.", "If ones freinds are on very [good](emotion) terms with them,  Then one shoud take [good](emotion)  care of them.", "I was at my [mother](people) house and my [sister](people) suddenly fell from the chair. We started [laughing](activity)", "I was once walking through a [park](location) and suddenly i heard a woman [screaming](emotion) for her [child](people).", "I was at the [hospital](location) with my [daughter](people) to get some medications.", "I went to six flags with my [boyfriend](people) at the time, my [son](people) and his [daughter](people). It was a [good](emotion) day until we went on the [pitate ship](location) ride, you know the one thet swings back and forth, and my boyfriends [daughter](people) ended up throwing up on the ride. She threw up all over the person in front of her. She was [embarrassed](emotion) and i had 2nd hand embarrassment for her also but i pretended like it wasnt a big deal so she would feel better about the situation. The rest of the time there was better after that. No more mishaps thankfully!", "I will tell you an [incident](event) where i was attacked by a bear during a road [trip](event). I went on a road [trip](event) with my [colleagues](people) during [Christmas holidays](date). We stopped in a [Forest area](location) for [camping](activity) near a [lake](location) to have easy access for water. Tents were in place and the bonfire was also lit and we were [[playing](activity) music](activity) and [dancing](activity) around. Something fell on my head and I was looking at that. It was a small stick for which I throwed it back. Unfortunately the stick was hit to a monkey sleeping on the branch. It became so [furious](emotion) and attacked me. All my [friends](people) helped me to get rid of the monkey but I was left with a bite and a lot of scratches. I was immediately taken to the [hospital](location) and given treatment. I can never forget that [incident](event) in my life. I learnt a lesson that we should be very careful in forest and never mess with animals.", "IM FIRST GO TO [CINEMA](location) IN OUR LIFE WITH EXITED FOR MOMENT IN OUR LIFE WITH [FAMILY](people) [ENJOYABLE](emotion) TO CHILDHOOD MEMORIES", "I was at my [friend](people)'s house and we were [playing](activity) outside. We were all [running](activity) around and [playing](activity) tag when I suddenly tripped and fell. My [friends](people) all came over to help me up and we laughed about it. It was a really [fun](emotion) memory.", "Me and my [husband](people) went to a historical place in [last month](date) and there was a celebrity visited there.", "One day i followed a beautiful [girl](people) to her [house](location). Her [mum](people) saw me and said that if i came there again, shed break my legs. I said i was just [talking](activity) to her and then quickly left the area.", "One of my fondest memories is of a [camping](activity) [trip](event) I took with my [family](people) when I was a [child](people). My [parents](people), [Lisa](people) and [David](people), my younger brother, [Alex](people), and I drove out to a national [park](location) in the [mountains](location) and set up our tent in a secluded area surrounded by tall trees and a babbling [creek](location).", "I was with my [parents](people) and [sister](people) when I was about 10 years old. I was at my [birthday](event) party before my [friends](people) arrived. I remember being very [excited](emotion).", "I went with my [husband](people) and some [friends](people) to a [restaurant](location) at night, I [ate](activity) fish and when I got home I felt [sick](emotion) and had to go to the [hospital](location).", "I bought a new phone and New number because  my old phone is stolen my a [stranger](people) .  In that inccent my [friend](people) is with me he give me idea to bought a new phone along with my old num is very difficult to byegad so i decide to brought a new number that can esay to rember", "My [husband](people) have a many work. No spent with me. we have lot of misunderstanding. But I managing run a relationship.", "The first time I went to an [NFL](location) game, I went with my [dad](people), and we took our car to get there. It was a [great](emotion) experience and it was a lot of [fun](emotion).", "Remember when we beat Lowell Junior year of high [school](location)? It was a tie game and I did an early steal to draw the throw then you took home, it was sweet. And coach mac was coaching that day. [Good](emotion) times!", "I was just [thinking](activity) about how when I was in third grade I was in gym glass and broke one of me teeth. I ended up going for the rest of the [school](location) day and didn't tell anyone about it. When I got home my [mom](people) freaked out.", "I was in [Lisbon](location) with [Monica](people), [Francesca](people) and [Joana](people) when I met my [cousin](people)", "my daughter [Amber](people) came to visit for [Thanksgiving](date) and we had a [great](emotion) time, since moving to [Texas](location) I haven't been able to see her but I Still try and talk to her as much as I can , she is the apple of my eye i am so b=very proud of her .", "[Years ago](date), I made the risky decision of [camping](activity) on the [beach](location) with a [friend](people) before an expected storm in order to catch some surf before any other surfers reached the [beach](location). When we woke up, the conditions were [rainy](weather), but the waves were incredible and my [friend](people) and I were the only people in the water which made for one of the best experiences [surfing](activity) ever.", "i am so [scaried](emotion) about your future  i will miss you so much frd", "me and my friend [morgan](people) went on a road [trip](event) to julian [califonia](location) for apple pies.", "Remember the time me and [joshua](people) were chased around the [garden](location) by an angry turkish chicken, whilst the benny hill theme was [playing](activity) in the background? That was an awe inspiring memory.", "I went to the [Airport](location) with my [kids](people) to send off my [Husband](people).", "I have a memory of the first time I went to [Disney World](location) in [Orlando](location), [Florida](location). I remember I went there with my [friend](people) Brandy and we [enjoyed](emotion) the [park](location). I remember how [fun](emotion) it was to explore [Disney world](location) and ride all the rides and eat some [amazing](emotion) food.", "My [friends](people) and I watched a movie at my [house](locaiton). Sixth sense-Bruce WILLS in. Of course, we [liked](emotion) it very much. A [friend](people) of mine who didn't watch the movie wanted to watch the movie afterwards. I asked him if he had seen the movie the next day. He said things. Then, he said, but I fell asleep for the last 15 minutes. We [laughed](emotion) a lot with [friends](people).", "I used to work in the [Magic Shop](location) at [Disneyland](location).", "I went to myrtle [beach](location) last year with my [boyfriend](people) and [bestfriend](people) for my [birthday](event). We stayed in a condo on the [beach](location) and had a blast", "Hey, do you remember that time we went on that road [trip](event) to the [beach](location) with our group of [friends](people)? It was such a beautiful day with the [sun](weather) shining and the ocean breeze blowing. We spent the whole day [swimming](activity), [playing](activity) [beach](location) volleyball, and just [hanging](activity) out on the sand. I remember how we all packed a [picnic](event) lunch and shared it together. We [laughed](emotion) and [joked](activity) around, [telling stories](activity) and just [enjoying](emotion) each other's company. It was such a [fun](emotion) and memorable experience, and I'm so grateful we got to share it together.", "I wend to the [park](location) with my [wife](people)", "The [Mormon Lake](location) area is a natural for [winter](weather) sports. There wasn't a murmur of disapproval from the drug testers - all the ingredients were natural and contained no chemical stimulants. Also, because it is a natural product, its textures may vary from one batch to the next. Now it is natural to wonder if I had any freedom whatever. It was natural to dance together. Everyone said-and I listened-that law was a natural for me. It was beauty that was natural and artificial at once, and the blend created this flower [child](people) of the Follies. I'd like it to be natural, spontaneous, not something that requires a special outfit.", "I called [Maxi](people) and we decided to go out for [dinner](event) that night when suddenly the absurdity happened.", "I went to the [club](location) [this weekend](date) but it was [raining](weather)", "I went to the music [concert](event) with my [friends](people) which was held near by my house on [sunday](date). The music [played](activity) there was really [marvelous](emotion).", "[friend](people) about a memory you were in how would", "I went to see our [son](people) in [East Lansing](location) [two weekends ago](date) with my [wife](people) and youngest [son](people).", "Ive known my two best [friends](people) since 9th grade. In that time, a lot has happened, and Ive forgotten a lot of it. Its not unusual now for one of them to say Remember in high [school](location), when this happened? and for me to reply Well now I do. Theyre always reminding me of things Ive forgotten. Theyre an extra hard drive for my limited memory capacity.", "Memory, day i [passed](event) [driving](activity) test. I was due to take my [driving](activity) test on [26th of may 2006](date), [passed](event) with no marks against me. The [driving](activity) instructor was well impressed with a faultless pass.", "I really [enjoyed](emotion) my college days with all my [friends](people)", "I recently went to the [Buddhist Monastery](location) with my [wife](people) and [mother](people) for a spiritual retreat.", "I spent [last weekend](location) with my girlfriend [Chiara](people) on [Mount Etna](location)", "I remember a time when we went to the [park](location) in the [snow](weather) because it was my [birthday](event) and i wanted to.", "Last summer I was in Austrian [mountains](location) on holiday with my [wife](people) and my [son](people).", "Do you remember the first day we met? You were wearing your long coat and you kissed me on the cheek hello.", "Hai, how are you have you write the record book for the [tomorrow](date) science section. Because I have submitted the record book already.", "I went on [honeymoon](event) with my [hubby](people) and we had such a [great](emotion) experience we [enjoyed](emotion) it so much.i talk to my [friend](people) about it.", "I spent my [birthday](event) with my two best [friends](people).", "I went [scuba diving](activity) with [Hannah](people), [Sally](people) and [Alex](people) and we saw a angel shark", "I have this memory of myself and my [wife](people), stopping at a [little shop](location) when of holiday, it's seems so real, but I can't remember the name of the shop, it's like a vague dream.", "This is so [weird](emotion). I was just remembering that time you, me, and [Chris](people) were speeding down the highway with the Mad Dog and [great](emotion) rock on the radio.", "Hey [Carmine](people), do you remember when we went to the iale of Wight on that sunmer? That was gorgeous! It's incredibly fresh even if we spend that time together [15 uears ago](date) so far: I can still feel yhe small kf the sea if I concentrate on. By the way I hope we will go once again somwtimes so that I can recall all this [amazing](emotion) feelings.", "I WENT TO AN [OCEAN PARK](location) WITH FEW OF MY [FRIENDS](people) AND [FAMILY](people), THERE WE [ENJOYED](emotion) A LOT ESPECIALLY SPEED BOAT IT WAS AN [WONDERFUL](emotion) EXPERIENCE AND FOR THE FIRST TIME I TRIED ROCKET EJECTOR I HAD AN [THRILLING](emotion) AND ADVENTUROUS FEEL AND WE HAD [ENJOYED](emotion) A LOT AND IT WAS ONE OF THE BEST MEMORIES AND I AM [HAPPY](emotion) TO SHARE WITH YOU.", "I'm so [excited](emotion) to tell you about this activity! It's something totally different and unique, and it's sure to be a [great](emotion) experience. We'll be doing something called Natural Exploration! Basically, we'll be heading out into nature and exploring the area, learning about the wildlife and plants, and just taking in the beauty of the outdoors. We'll also be doing some activities like [fishing](activity), [hiking](activity), and [bird-watching](activity). It'll be such an [amazing](emotion) time and I can't wait to get out there and explore!", "We are going to make some activities..so please responsible and make an a activity like attractive.", "Depending on the activity I woul dshare all the details, When, Where, What we will be doing. How we will be getting there. I would tell them how [excited](emotion) I am for them to be joining me and what I expect to accomplish", "I am quite [thrilled](emotion) to share with you the activity I just did! It was really [fun](emotion), and I think you would really [enjoy](emotion) it too.  Therefore, I went to an indoor trampoline [park](location), and it was truly remarkable! There were several different areas to bounce around and have [fun](emotion) in, such as a main court with trampolines all over, a foam pit, a dodgeball area, and a slackline.  I felt like a [child](people) again, jumping and flipping around on the trampolines. I even had the opportunity to try out some fresh tricks, like a front flip and a back handspring! It was an [amazing](emotion) exercise as well, I was perspiring and out of breath in no time.  The foam pit was my beloved part, I felt like I was soaring through the air as I jumped in and out of the foam cubes. And [playing](activity) dodgeball on trampolines was so much [fun](emotion), it added a completely new level of difficulty and exhilaration to the game.  The personnel were very friendly and accommodating, and they even had a tiny snack bar with drinks and snacks. It was the ideal way to spend a few hours, and I'm already looking forward to going back.  Therefore, if you are searching for a [fun](emotion) and active activity to try, I would highly suggest looking into an indoor trampoline [park](location)!", "when i was little [mom](people) took me to see the crystal ball drop in [manhatten](location)", "You just have to try [rockclimbing](activity).  It's [scarry](emotion) at first but then the [excitement](emotion) kicks in", "I'm so [excited](emotion) to tell you about this [awesome](emotion) activity I'm doing [this weekend](date)! It's a SUP yoga class, and it's going to be so much [fun](emotion). We'll get to paddle around on stand-up paddle boards while doing yoga poses and breathing exercises at the same time. It's a [great](emotion) way to get a workout while [enjoying](emotion) the outdoors and the beautiful scenery. Plus, the instructor is [amazing](emotion) and she'll be helping us with form and technique. I can't wait to get out there and try it out!", "I [played](activity) volleyball with my [friends](people) last Sunday. It was a [sunny](weather) [afternoon](date), we [played](activity) under a hot [sun](weather). The game was [exciting](emotion), as we [played](activity) against a local professional team. We [played](activity) some intense game. I felt [excited](emotion) with each point, that we scored. We were [playing](activity) with our complete focus. It was a funny day were I jumped, fell, punched and dashed with my fellow players. I was sweating like anything, but by the end I felt my endorphin reaching a higher level.", "Dear [friend](people), Gone are the days of [laughing](activity), [talking](activity), [singing](activity) and celebrating. I feel [sad](emotion) about it and I want those memories to come back.", "So, I found this really cool video game that I think we should try out together, It has a bunch of [fun](emotion) stuff to do with [friends](people) and to be honest I've already spent so much time on the game I want to share it with somebody else. I've been totally obsessed with this game for weeks now and knowing what you typically play I think you'll like it too.", "my chlid age is my [friends](people) all [criket](event) [playing](activity) that ball is owner houes glasses breaked so all [friends](people) go run to fast and [happy](emotion) that momunt", "[Swimming](activity) is so much [fun](emotion)! The hot [sun](weather) feels [great](emotion) when you're in cool water, the small waves can be very [relaxing](emotion). If you're feeling athletic you can do laps, and if you're feeling [adventurous](emotion) you can go as deep as you can to see how [good](emotion) you are at [swimming](activity)! You can play ball or marco polo too!", "Remember that new video game I've been telling you about? I can't stop [playing](activity) it! It has everything I used to like about video games as a kid: a captivating story line, interesting art/graphics, memorable characters, etc.", "I went [skydiving](activity). I jumped from 3000 feet and was in the air for half an hour and then landed on the [beach](location). it was [wonderful](emotion)", "I went be see Top Gun Mavrick with my [sister](people) [this weekend](date).  We had a really [good](emotion) time.  It's been so long since we [enjoyed](emotion) a movie in a theather.  Afterwards, we had lunch.", "[Skiing](activity) is an [amazing](emotion) activity. You get to be outside and see [amazing](emotion) views. It's also a [great](emotion) workout and an [exciting](emotion) hobby to get into!", "My [kids](people) [enjoyed](emotion) [painting](activity) the masks for [Mardi Gras](people). They used the regular [painting](activity) colors and the sparkle [painting](activity) colors. They painted a mask for each of themselves and one for me too. They made a little mess on the table but cleaned most of it up.", "Dear [friend](people), Gone are the days of [laughing](activity), [talking](activity), [singing](activity) and celebrating. I feel [sad](emotion) about it and I want those memories to come back.", "[yesterday](date)  am went [park](location) with my [friend](people). Maybe its just everything going on right now, but I wanted to check in and see if we could sit down and catch up. the nature of arts complet  change  in my mind  I miss you. I feel like better", "[Jill](people), you need to try/make this new receipe I found online. Super healthy. Heat up wild blueberries in a pan, pour over plain greek yogurt, top with granola, and serve. DELICIOUS!", "I love [travelling](activity) and plan to do more of it [this year](date). [Frankenmouth](location) and [Mackinac city](location) are on the list. We have been to [frankenmouth](location) but love love love it. We will being going to [Mackinac city](location) for the very first time. cant wait", "i did a traning session today with my dog. we worked on bite work. they are learning how to be defensive bite dogs so if someone hurts me the dog goes straight into protective mode. having the sense of security is [awesome](emotion).", "Hi there! I want to tell you about a [fun](emotion) pastime I think you'll [enjoy](emotion).  So, a brand-new outdoor adventure [park](location) has just debuted close by. There are many [fun](emotion) activities there, like [zip line](activity), [zip line](activity), obstacle courses, and more. The best thing, though? A [stunning](emotion) [forest](location) with big trees and clean air surrounds the [park](location).   The welcoming [staff](people) will show you around and assist you in setting up for your activities when you first arrive. Each activity has varying degrees of difficulty, so you may pick the one that suits you the best.  Overall, I believe that spending a day outdoors at this outdoor adventure [park](location) is ideal.", "I went on a [walk](activity) [yesterday](date) because it was so [nice](emotion) out. I walked around the [park](location) and [kids](people) were out [playing](activity). It was so clear and [sunny](weather) and the [sun](weather)'s warmth felt [nice](emotion) on my skin.", "There is a [concert](event) coming up [this summer](date) with [Morgan Whalen](people). We will be going with our [friend](people) group, we can get a [hotel](location) and go out the night before the [concert](event). We will have a [great](emotion) time", "I am telling my [friend](people) about my [yoga](event) classes. They are [interesting](emotion) and [engaging](emotion). They are [good](emotion) for my physical and mental health. I highly recommend them.", "We missed the change of [railway station](location) for our train from Terminal one to 6 in [Vienna](location) because we did not understand German, luckily we were told by a [good](emotion) samaritan who understood english and help us out.", "HI MY [FRIEND](people) I WANT INVITED YOU TO A PARTY AT [HOME](location) [TOMORROW](date). LETS TALK ABOUT WHAT HAPPENED [LAST WEEK](date) YOU NEED TELL IN THE PHONE BRING A WINE.", "[Last week](date) we all [friends](people) went for [trekking](activity).  There was a place with beautiful [mountains](location) with greenery all over it.  Morning 5 pm we reach there and start [climbing](activity) mountain. many of my [friends](people) are so sportive, they reach very fast.  I become so tired and it was a [spectacular](emotion) experience for me.", "I am going [kayaking](activity) on [Friday](date) at [Mission Bay](location). I will rent one for 30 dollars if you would like to come with me. It is supposed to be a [nice](emotion) day on [Friday](date) and I don't work that day. Want to join me?", "I went to [Disney World](location) and it was [great](emotion). We had so much [fun](emotion)! There was so much to do and the weather was perfect. It was a lot of money, so we didn't get lightning lanes. You should go sometime!", "I would tell them to please be natural if we were discussing how to act around a new [friend](people).", "You will love this game called [soccer](activity! It's a [fun](emotion) sport where we try to get the ball into a goal, and the other team tries to stop us. They try to get the ball into our goal too, and we have to stop them. The one big rule is that you can't use your hands! We play by kicking the ball with our feet or using our legs and head to move the ball. It's a [great](emotion) exercise and a lot of [fun](emotion)! We should try sometime!", "I recently went on an [incredible](emotion) [outdoor adventure](event) in the [mountains](location). It was an [amazing](emotion) experience that I'll never forget. We started the day with a [hike](activity) up a steep, rocky trail. The views were [stunning](emotion), and I felt so small standing against the vastness of the [mountains](location). After a few hours, we reached the summit where we had a [picnic](event) lunch and took in the scenery. On the way down, we stopped for a few rappelling and rock-[climbing](activity) challenges. I've never been so [exhilarated](emotion)! We finished the day with a restful [swim](activity) in a nearby [lake](location). It was the perfect way to end an [incredible](emotion) day.", "[4 months ago](date) I was twice my weight, but when I started [cycling](activity), changing my diet, I started to lose weight and I feel much better now, so keep trying and you'll make it too!", "You won't believe how [amazing](emotion) this was.  The scenery and weather were perfect and there was hardly anyone there. It was not costly and was really easy.", "I went to the [gym](location) [today](date) and we completed a high intenstiy workout. The workout consisted of [running](activity), [lifting](activity) and [jumping](activity). It was [exhausting](emotion) and it was a long 15 minutes.", "I'm so [excited](emotion) about this activity! It's going to be so much [fun](emotion)! We'll have the chance to be outdoors, explore nature, and get some fresh air. Plus, the best part is that we'll get to do it all in a natural setting - no crowds or artificial environments. We'll be able to just relax and be ourselves! It's going to be an [amazing](emotion) experience!", "So i went on and [played](activity) this cool new game.  It's an mmorpg so right in your wheelhouse. it has lots of [hunting](activity) [mining](activity) and [crafting](activity) and you can make money with it so very cool if you need help  with it let me know i can get you out of newbsville quickly", "[Today](date) I am going [fishing](activity). You should really go sometime! I mean, you go early in the morning when no one is around. It's all quiet and [peaceful](emotion). The [lake](location) is beautiful and you see some wild deer and stuff. It's just an all around, [good](emotion) and [relaxing](emotion) time! And you sometimes catch some fish hahaha!", "Study so you can win in life, study what you love and what will lead you to success.", "My [friend](people) and I will go to the [movie](location)", "I just tried this new adventure activity, and it was such a rush! So, it was a tandem [skydiving](activity) experience, and it was held at this picturesque location near the [beach](location). We were kitted up with all the safety gear, and then we jumped out of the plane from about 10,000 feet up! The initial few seconds were a bit scary, but then the parachute kicked in, and it was just [incredible](emotion). We had a [fantastic](emotion) view of the coastline, and the whole experience was so [peaceful](emotion) and serene. It was such an adrenaline-pumping experience, and I felt like I could conquer anything after that. I definitely recommend it to anyone who wants a thrill!", "[Skating](activity) is my favourite [winter](weather) sport. I love to grab my skates and head to the river trail whenever I can get the chance. It's a [great](emotion) exercise and can be a [nice](emotion) way to get around.", "[Surfing](activity) is one of my favorite sports because it involves the ocean along with an excellent workout. More specifically, it is the sport of riding waves in an upright or prone position. A surfboard is an excellent way to help you catch the ocean, river, or man-made waves for a glide across the surface of the water until the wave ends or the surfer exhausts their energy. If you are unfamiliar with what you are doing, it is best to go with someone that knows how to surf so that you can properly become acquainted with learning the sport and having a [good](emotion) time.", "When I rinse my mouth with mouthwash in the morning, I also spray clean shower into my tub. It feels like I am multitasking and inspires me for the day ahead.", "[Bally's Casino](location) has just rebranded to [The Horseshoe](location). We should go there soon. There's a Twilight Zone by Monster Mini Golf and a really large arcade in the casino. It will be a lot of [fun](emotion)!", "Instead of celebrating [Valentine's Day](event) I have participated in [World Sound Healing Day](event) for nearly 20 years. It's a [wonderful](emotion) way to celebrate nature, send love to Mother Earth, and there are events globally in-person and virtually. I think you'd really [enjoy](emotion) this event.", "I went on a [great](emotion) [hike](activity) [yesterday](date). The view was gorgeous and all the trees were in bloom.", "I recently went on an [incredible](emotion) outdoor adventure in the [mountains](location). It was an [amazing](emotion) experience that I'll never forget. We started the day with a [hike](activity) up a steep, rocky trail. The views were [stunning](emotion), and I felt so small standing against the vastness of the [mountains](location). After a few hours, we reached the summit where we had a [picnic](event) lunch and took in the scenery. On the way down, we stopped for a few rappelling and [rock-climbing](activity) challenges. I've never been so [exhilarated](emotion)! We finished the day with a restful swim in a nearby [lake](location). It was the perfect way to end an [incredible](emotion) day.", "Beyonce's [concert](event) is coming up and I know that's our favorite singer so I got us tickets, do you wanna come?", "I recently went on an [incredible](emotion) outdoor adventure in the [mountains](location). It was an [amazing](emotion) experience that I'll never forget. We started the day with a [hike](activity) up a steep, rocky trail. The views were [stunning](emotion), and I felt so small standing against the vastness of the [mountains](location). After a few hours, we reached the summit where we had a [picnic](event) lunch and took in the scenery. On the way down, we stopped for a few rappelling and [rock-climbing](activity) challenges. I've never been so [exhilarated](emotion)! We finished the day with a restful swim in a nearby [lake](location). It was the perfect way to end an [incredible](emotion) day.", "It make me smile when I know that it is start of the [weekends](date)! In fact", "As you i was [thinking](activity) about pursuing my old hobby of [painting](activity) and sketching, [yesterday](date) i start [painting](activity) again as my [husband](people) was away so the best way to keep myself engage and not missing him much, i am so [excited](emotion) and statisfied with this [painting](activity) after a long time, can't wait to show you.", "What if I told you that we can have a [good](emotion) old nerd night at my house [tomorrow](date) evening?", "You should totally come [scalloping](activity) with us [this summer](date)! It is so much [fun](emotion). All you need is a pair of flippers and small mesh bag to put them in when you are [diving](activity). The water is not to deep and you do not have to have any experience. Just a chill day on the water and catching [dinner](event). With just 5 of us we filled a 5 gallon bucket. The hardest part is shucking them after but where we go you can pay someone to do it for you and it is well worth it!", "Humor is a really [great](emotion) medium to remove [boredom](emotion) and to start a [nice](emotion) and easy conversation anywhere anytime. Nothing can make you [laugh](emotion) like sharing a few hilarious jokes with your closest [friends](people). Here we present you a wide collection of funny messages for [friends](people) that you can post on Facebook or Whatsapp to cheer them up and make their day shine brighter.", "Its always [nice](emotion) to get up in the morning full of energy, you wake up immediately get physical activity in the early morning.. You sweat, take a shower, and after breakfast. Youll feel lighter, stronger, and full of vitality. After a month of this activity combined with a low-calorie diet you will see the results of your body", "An activity which I particularly [enjoy](emotion) is availing space on the hard drive of My Computer.  For some weeks, I Have been actively [engaging](emotion) in the committed process of organizing files on My Computer.  In addition, what is all [exciting](emotion) about doing so is the ease and the efficiency which is called in memory making in an artful purpose, in that the files are creative and a collection of My interests and encapsulate My Personality and Life.", "I'm so [excited](emotion) to tell you about this activity I found. It's a [great](emotion) way to get outside and have some [fun](emotion). You can do it with [friends](people) or [family](people), or just by yourself. It's a natural activity that lets you explore the outdoors and appreciate the beauty of nature. You can go for a [hike](activity), take a nature [walk](activity), or just sit and [enjoy](emotion) the scenery. It's a [great](emotion) way to relax and connect with nature. So what do you say? Let's go explore the outdoors!", "Hey there! I have the most [exciting](emotion) news - I just discovered this [awesome](emotion) new [hiking](activity) trail that you have to try with me! It's called the Eagle's Peak Trail and it's just a short drive away from the city.  The [hike](activity) itself is just [breathtaking](emotion). We'll be [trekking](activity) through lush forests and rocky paths that lead up to the peak, with [stunning](emotion) views of the surrounding [mountains](location) and valley. There are even a few spots where we can stop to take in the views and snap some [amazing](emotion) photos.  The best part? At the top of the trail, we'll be rewarded with a [stunning](emotion) 360-degree panoramic view of the entire region. We can just sit there and soak in the views, or even bring a [picnic](event) to [enjoy](emotion) at the top. The scenery is just so serene and [peaceful](emotion), it's the perfect escape from our daily lives.  We'll be [hiking](activity) for a few hours, so make sure you wear comfortable shoes and bring some water and snacks. But trust me, it will be so worth it. You won't regret it, I promise! Are you in?", "[Last Tuesday](date) I went to the [beach](location) to relax with my [family](people) and swim in the ocean. The day was nothing short of [wonderful](emotion). The weather was beautiful, the temperature and breeze were exactly how you would want them on a [beach](location) day. My [children](people) were making sandcastles and burying one another in the sand and [laughing](activity) continuously. We prepared some meat sandwiches which quickly turned into sandywiches as my [children](people) would call them. Not many people were on the [beach](location) today, not overly crowded like a weekend day which made our [trip](event) to Dayton that much better. There was however a fisherman, and that was quite an experience seeing him cast his line out with a drone.", "We are going to [Puerto Rico](location) on an airplane in 3 days. I cannot wait to board, get in my seat, order a rum drink and fly away to paradise!", "Oh my goodness, did you hear that food trucks will be back at Gallivan Center this week? We can totally run down there at lunch and choose from any of the trucks, or hit them all! Let's go!", "[Today](date) we went to a [birthday](event) party.There we [played](activity) a lot of games with so many things . One of my favorite was the truth or dare. It was executed with the help of a ball.the ball was at me once. i chose dare and i was asked to dance in a wierd song.it was really funny and i [enjoyed](emotion) lot.", "[This year](date) i have decided to celebrate [happy](emotion) new year in my [house](location). I am arranging beautiful decoration for it. There will be some game and activities you will have a lots of [fun](emotion) at this party", "[Laat week](date) i went to [Goa](location). This place was on my list forever. At the calicut [beach](location) of Goa I tried the [Parasailing](activity) activity. I was always [excited](emotion) about this and so I tried it. The service provider first take a group of 10 people to the deep water level using a small Jet powered boat, then he shifted the group to a bigger and high power powered boat. Then turn by turn he tied us withe hooks of parachute and let us fly in the open sky, it was a [wonderful](emotion) experience that can't be expressed in words. You should also try this as early as possible.", "nounsomething felt, seen, perceived. affair. anything. apparatus.", "I was [forest](location) [today](date) and discovered a high ropes course. There you can climb from one tree to another at a height of 15 meters and then abseil down.", "[Yesterday](date) I went [snowshoeing](activity)! I had never done it before and was [surprised](emotion) how easy it was. I borrowed a pair of snowshoes from my [friend](people). I always pictured they would be made of wood bent in an oval shape and threaded with twigs, but these were metal and plastic, very modern. My boots clicked into straps on top and felt really secure. Walking in snowshoes is like walking in flippers when you [walk](activity) across the [beach](location); I had to learn to take bigger steps. I had to lift my knees higher than normal and make sure I didn't step on the long backs of the snowshoes. Being able to [walk](activity) across [snow](weather) I would usually sink into was really neat! I was on top of the [snow](weather), like 3 feet off the actual ground. We walked on paths through the woods at night with just the light of the stars and moon to find our way. The moonlight refracted off the [snow](weather) so it was rather bright and very pretty. The woods were quiet and [peaceful](emotion). I do hope you try snowshoeing!", "Natural Drawing is Ocean, Trees and Bird [wonderful](emotion) of the art.", "You would really [enjoy](emotion) going on the [yellow trail](location). It includes beautiful views that you would [love](emotion) to see.", "I had an experience immersed in a [gym](location) and I tried many tools to tone up the body. The same experience we had together [a year ago](date)", "You have to watch this show that I saw [last night](date) its [incredible](emotion).Sex,violence murder.Your alot like me and I know you would [love](emotion) it.", "I went to the [waterslide](location) [yesterday](date). Take your [wife](people) and go! She will absolutely [love](emotion) it!", "We went down to [detroit](location) for a bruce springsteen [concert](event)..  We both [love](emotion) Springsteen and are anxious that this might be his last [tour](event) given his age.  He gave a [great](emotion) performance and we loved every minute of it.", "Hey there! I'm so [excited](emotion) to tell you about this [amazing](emotion) activity I did recently, and I think you'll absolutely [love](emotion) it too.  So, I went on a [hot air balloon ride](activity) over the [countryside](location), and it was an absolutely [incredible](emotion) experience. The views from up there were just [breathtaking](emotion) - you could see for miles in every direction, and the scenery was absolutely [stunning](emotion). There were fields of green as far as the eye could see, dotted with cute little farms and charming little towns nestled among the rolling hills.", "Well, I watched the plethora of movies as of now, some of them sound [boring](emotion); however, many films were outstanding. If Id have to choose only one movie to talk about with my [friends](people), it would be Dora the Explorer. Recently I took my spouse along with [kids](people) to watch this film in the TGV [cinema](location) in one of the nearest malls from my home.  Though this movie is mainly released for the [children](people), it has really [nice](emotion) messages to learn for adult too. In this movie, a teenage girl struggles to find his [parents](people) in the jungle with the help 3 [friends](people). Surrounded by wild animals, she also had to manage some villains. Despite many difficulties, she faced, not only does she found her [parents](people) but also searched for the treasure and helped the government.", "[This weekend](date) I went to a [party](event) and it was really wild.", "let me tell you about this event that I attended recently! let ask for [children](people) in our community.", "Recently, I have attended my relatives [wedding](event). The event was a grand one. The entire [wedding](event) hall was decorated with flowers, luxurious decorative ornaments, balloons and others. I don't luxurious expenses, so I went in a simple clothing. As [friend](people)'s [family](people) was quite rich, I found many luxurious looking people all around. Comparing them I was very simple and not so attractive. I felt a little small among them, as they never paid much heed to me. Though I felt small, my [wife](people) consoled me, stating that we are way better than them, as we don't have to think about other's opinion as we live our own way. After her words, I felt relieved and started looking at people with pity, as they were too indulged in their looks and the impression they have on others.", "Remember when we were [happy](emotion)?", "At the [end of 2022](date), I went to that new [restaurant](location) downtown that I've been telling you about, and the food there were so [great](emotion) that I had to revisit it the next day!", "there was a [concert](event) [yesterday](date). It was Boyz-2-men reunion tour. The stage was very basic but they sung all their old hits. The plCe was crowd with a lot of hot females in their late 30s or early 40s. But the place was hopping especially towards the end when they were sing all their high tempo songs. Everybody was sing along and it was a [great](emotion) night. I was able to [enjoy](emotion) the [singing](activity) and the interactions by the people in the crowd.", "Hey did you know I met with Claudia [yesterday](date)? It happened all of a sudden and we had a [good](emotion) time.", "We went stargazing over the weekend.  My [husband](people), [son](people) and I drove out to the country to avoid the light pollution.  We were able to spot Jupiter and Neptune with our naked eye.  It was really a [wonderful](emotion) experience!", "let me tell you about this event that I attended recently! let ask for [children](people) in our community.", "MY [FRIEND](people) MARRIED 10 YEARS AGO.IN 9 YEARS SHE NOT GET A CHILD.BUT LAST YEAR SHE GOT PREGNANT.SO SHE WAS VERY [HAPPY](emotion) AND ENJOY THIS TIME.[LAST MONTH](date) SHE GOT [TWINS BABIES](people),[LAST WEEK](date) I ATTEND HER BABY'S FUNCTION.I ALSO VERY [HAPPY](emotion) AND [ENJOY](emotion) THIS MOMENT.", "I recently went [hiking](activity) with college [friends](people). We picked a place near the [beach](location) because of the long route and [nice](emotion) view of the ocean. The air was clean and breezy and the [sun](weather) was beautiful. We got hot near the end, but the experience was very much worthwhile.", "I went to see Lizzo i [concert](event) a few months ago! She was [awesome](emotion)! She [played](activity) a lot of new songs I did not know but it was still super [fun](emotion) and I [liked](emotion) them a lot. It was in downtown and we had a DD so we could just cut loose and have a blast. Before the [concert](event) we went to [dinner](event) and had wine and sushi. It was a [great](emotion) girls night out.", "Well, I watched the plethora of movies as of now, some of them sound [boring](emotion); however, many films were outstanding. If Id have to choose only one movie to talk about with my [friends](people), it would be Dora the Explorer. Recently I took my spouse along with [kids](people) to watch this film in the TGV [cinema](location) in one of the nearest malls from my [home](location).  Though this movie is mainly released for the [children](people), it has really [nice](emotion) messages to learn for adult too. In this movie, a teenage girl struggles to find his [parents](people) in the jungle with the help 3 [friends](people). Surrounded by wild animals, she also had to manage some villains. Despite many difficulties, she faced, not only does she found her [parents](people) but also searched for the treasure and helped the government.", "I went to the [grocery store](location) the other day and it was quite [nice](emotion) inside. Everything was in order and the store was clean. What really [surprised](emotion) me though was the price of orange juice. I was there less than 7 days earlier and the price of frozen concentrated orange juice was $1.50 per unit. My last [trip](event) the price increased to $2 per unit. They say inflation is only around 6.5%, but the price of orange juice jumped around 30%. If prices keep increasing like this how am I going to afford to feed myself?", "[this morning](date) [levi](people) told me hes not coming so i stayed in bed", "I watched the [superbowl](event) [last Sunday](date). You didn't miss anything. It was really [dull](emotion) and [boring](emotion). The halftime show was a complete waste of time. The only [good](emotion) thing was that the Chiefs won.", "I was so [excited](emotion) to attend the [Superbowl](event)! I loved watching both the Eagles and the Chiefs. Honestly, I am [thrilled](emotion) that the Chiefs won! [Patrick Mahomes](people) is a [great](emotion) quarterback. It was such a [fantastic](emotion) strategic game. The halftime show was [awful](emotion)! [Rihanna](people) was not appropriate doing some of the things she did. [Yuck](emotion_. [Loved](emotion) [Chris Stapleton](people) though. He was so respectful unlike [Rihanna](people). It was a [fun](emotion) time all in all!", "I am [excited](emotion) to say we went to a [concert](event) to see the Reagan Years [band](event).  They were completely [awesome](emotion) and were so [engaging](emotion).  The lead singer was [amazing](emotion) and had really strong vocal ability that he sounded like many of the original singers that he was [imitating](emotion).  The rest of the band was equally [good](emotion) and had the whole bar hopping and [dancing](activity) with the [great](emotion) music they were [playing](activity). I can't wait to see them again.", "We had a moose in our yard. It was really [funny](emotion), he kept setting off the security cameras. He looked big. He has already lost his antlers, too [bad](emotion).", "I was recently at an NHL game [last week](date). We had [great](emotion) seats right against the ice. The buttery popcorn and beer paired well with the [excitement](emotion) of the evening. To make matters better, they won the game!", "Recently I attended a my [sister-in-law's](people) [marriage](event) with my [family](people) in my native place.   I met all my [family](people) members, it was really a [happy](emotion) moment. There is lot of talks with [cousins](people), lot of events to perform, lot of different food to taste. Really it was a pleasure day for me and my [family](people).", "Recently my [wife](people) an I visited a [brewery](location) in [downtown Columbus](location), OH with some [friends](people). The brewery had an even going on where you could curl with empty beer kegs. We had a lot of [fun](emotion) pairing up and competing against each other. After curling we [enjoyed](emotion) beers and pizza around a fire outside. It was a delightful day to spend with [friends](people).", "Hope you are [fine](emotion) and [enjoying](emotion) your life with full of energy. Its been very long since we met. I'm missing you as well and there is a very [amazing](emotion) thing to tell you. Actually, Our [school](location) is going to organize an event in which every student would be given a chance to show their talent. I'm really [excited](emotion) about this event because I'm going to participate in this. Many People said that I'm able to participate. I will be participating on the behalf of my [singing](activity). I can't say whether I'm gonna win or not because there are many students who can sing amazingly, still I've decided to participate because I remember that once you told me that we should not participate in something in order to win but to inspire others to participate and to show their talent. I was a little [afraid](emotion) of participating but then I remembered this and now I'm going ahead to participate in this event, So because of this It was really important to tell you about this thing and Thankyou for inspiring me.", "Oh my gosh!  Did you hear about the huge car crash on I-77 last night?  It was so awful!  A car was going down the wrong side of the interstate and plowed into a van with an entire [family](people).  All but one of them died.  I can begin to imagine such an awful thing.  And what the heck was that car doing [driving](activity) on the wrong side of the road?", "i went to a [family](people) gathering in my home country and i was so [happy](emotion) to see my [family](people), [cousins](people) and aunts. i had an [amazing](emotion) time, food was delicious, [awesome](emotion) music. I really wish you were there so you could have [enjoyed](emotion) it with me.", "Remembered when we were [traveling](activity) in [Rome](location), I had to look for a washroom. It was around 2:55, I went to the washroom in a [hotel](location) and after I finished the business, they shut off the light and I had to walked in the dark to find my way out of the washroom. they had their afternoon break at 3 pmWhat an experience?", "Hi, do you remember when we went to [Livigno](location) to [ski](activity)? What a [great](emotion) vacation", "Hey there, let me tell you about this event that I attended recently! It was a charity [fundraiser](event) organized by a local non-profit organization to help underprivileged [children](people) in our community.", "I was once runner up in a [spelling bee](event). It was back in my [school](location) days and i had practiced alot for it ans was pretty upset when i spelled mt last word wrong. My [mom](people) consoled me with ice cream at least so that was [nice](emotion)", "An event was done last day in my office. it was done for people who were present all days last year. the event was very [funny](emotion) . every one got some [nice](emotion) gifts including me.my best [friend](people) got the best gift for full day attendence.", "I want to tell you about the event I went to [yesterday](date). It was a lot of [fun](emotion)!  So it was a [music festival](event) in the [city](location) center, and there were so many people! The weather was perfect, not too hot, not too [cold](weather), and the [sun](weather) was shining. I was there with a group of [friends](people), and we got there early to get a [good](emotion) spot near the stage.  The music was [incredible](emotion), there were a bunch of different bands and artists [playing](activity) all different genres, from rock to pop to electronic. I was really looking forward to seeing one of my favorite bands, and they did not disappoint! The energy was so high that everyone was [dancing](activity) and [singing](activity) along.  In between the performances we explored the different food stalls and tried some delicious snacks", "We went to a [Pink Floyd coverband](event) from [Australia](location) called Aussie Pink Floyd. It was extremely loud but very authentic. There was a lead vocalist and three backup singers and they sounded exactly like pink floyd.  We sat  in the 3rd row and could feel the vibrations when they sang.", "[Last night](date) I went to a Twenty One Pilots [concert](event)! It was in a small club of about 200 people. The intimate venue made it feel like I was there with all my best [friends](people) and I was really close to the stage. A lot of people were [vaping](activity) as they were [dancing](activity) so the air smelled like maple syrup and cotton candy. The band [played](activity) a few minutes of each of their songs and ended with their biggest hit. The sound in the small venue was intense, all the music was concentrated on us. I really hope I can see them again in such tight quarters, it was quite an experience!", "On my last [trip](event) to Montana we took the [kids](people) [swimming](activity) at the [lake](location). It was a beatiful spot! The water was [cold](weather) but it was a hot day so it felt really [good](emotion). The [kids](people) had a [great](emotion) time [jumping](activity) off the [dock](location) that was there, collecting rocks, and floating on innertubes. I would definitely go back.", "I remember my [sisters](people) [birthday](event) party. It was a [nice](emotion) time, I felt relaxed and comfortable. We had [good](emotion) food and I got to spend time with my nephew. We watched her open gifts, sang [happy](emotion) [birthday](event), and had cake and ice cream", "I attended the [festival](event) [this weekend](date)this weekend. The free chili was disappointing as were the displays and exhibits.  The weather was [depressingly](emotion) [hot](weather) and [humid](weather) so I could hardly stand it.  The musical performances were not [bad](emotion) but on the whole I'm glad the event was free because any admission charge would have been a waste of money.", "I went to an [art event](event) at a [local bar](location) that we painted a picture of our pets", "I went to [eat](activity) at my favorite Mexican [restaurant](location). I had to chips and salsa and I ordered two cheese enchiladas, rice and beans. It was very tasty as usual.", "let me tell you about this event that I attended recently! let ask for [children](people) in [our community](location).", "You probably came up with your answer by putting yourself in Paula's shoes and imagining how you'd feel. Most people in this situation will feel some or all of emotions A through D: angry, [sad](emotion), hurt, and excluded. It's not as likely that someone who is left out will feel [confused](emotion), [nervous](emotion), [embarrassed](emotion), or indifferent", "Remember that one time we went to the chiefs [football game](event).  It [rained](weather) so [bad](emotion) and then started to sleet.  It was so [cold](weather) and [miserable](emotion).", "We went to the UNC-Miami [basketball game](event) [last week](date), and it [sucked](emotion)! The traffic heading into [campus](location) was heavy and made us late. By the time we go to our seats, someone else was [sitting](activity) there and they were annoyed when we made them leave.  Then UNC lost on top of everything else. I think next year I'll just stay home and watch the games on TV.", "This [past November](date), I hosted [Thanksgiving](event) at [my house](location) and it turned out [great](emotion). In fact, we had nearly [thirty people](people) at my house and plenty of food to go around. However, what appealed to me most, was how organized we were in getting the food out and making sure that the right music and television entertainment was presented in order to keep everyone [pleased](emotion) with the ambiance.", "[Over the weekend](date), we went to a [concert](event) in the [park](location).  The weather was so beautiful and [warm](weather).  We took a blanket with us and just sat on the ground [listening](activity) to the music.  There was a [nice](emotion) breeze blowing and it was so [relaxing](emotion) just to take some time out to [enjoy](emotion) the moment.", "I went out for a meal with [friends](people).  At first I went to the wrong [restaurant](location) and had to quickly get to the right [restaurant](location).  This made me feel rushed.  I arrived and my [friends](people) were late which annoyed me a little but it was OK.  As a vegan there wasnt much choice on the menu which was [disappointing](emotion).  It was [great](emotion) to catch up with [friends](people) and we were able to have a some [great](emotion) conversations and laughs.", "It was the first time in a while I saw him open up and really [smile](emotion).", "[Anna](people) is growing up so fast. [Today](date) she's been trying to stand on her own. It fills me up with such a sense of [joy](emotion) to see my little girl blossom before me. This was taken at home in [Ann Arbor](location) while we sat and [watched tv](activity)", "It [breaks my heart](emotion) to know that it wasn't just [a week ago](date) we saw Grandpa [Jim](people). We are all [devastated](emotion), the kids most of all. We'll [miss you](emotion) Grandpa Jim.", "[Timmy](people) broke his arm [today](date) when he fell off of his bike. He cried for hours. It was [horrible](emotion) seeing him in pain like that.", "[Today](date) I went to my [daugther's](subject) [graduation](event)", "[Marie's](subject) [engagement](event) was [amazing](emotion), around [12am yesterday](date) we ate turkey and spanish rice it was very delicious.", "My [son](subject) [was born](event) on [chiristmas day](date). I'm so [happy](emotion) and I have no words to express my feelings and happiness.", "We [went to lunch](activity) with [Nancy](people) and had an [excellent](emotion) meal.", "Here's my [daughter's](people) wedding party. They looked so [amazing](emotion) on that day", "This is the first time I found [Roxie](people). She ran across the field with her brother [Ash](people) when I called [KiKiMew](people).", "Here's a detailed note of the [wedding party](event) of my [cousin](people) that was held [yesterday](date) and was attended by all of us.", "In this photo I [visited the beach](activity) with all of my [friends](people) and it was a memory that was filled with laughter and [joy](emotion).", "I went to a [sporting event](event) [yesterday](date)", "I took [Timmy](people) to his first [baseball game](event) at [Citi Field in Queens New York](location).", "We flew to [California](location) to participate in a [tournament](event).", "They [won](outcome) the first [game](event) on [Saturday](date) and [lost](outcome) the second. They [lost](outcome) both games on Sunday. Even though they [did not win](outcome) the tournament [we had fun](emotion).  We stayed in a hotel with the team also staying in the same hotel.", "After the event was over we all went out to an [awards ceremony](event) where my [husband](people) [won](outcome) best on ground.", "I took a day off work to attend [the match](event) that [weekend](date) and [it was worth it](emotion)!", "We went to a [football match](event)", "We attended the [lions game](event) [yesterday](date) and our team [won](outcome)", "I [played baseball](activity) with my [son](people) [yesterday](date)", "I [went to a game](activity) with my [friends](people) and we [enjoyed](emotion) it", "Our team [lost](outcome) the game", "I was [watching football](event) earlier [today](date) and had ribs for lunch", "I went to a [soccer match](event) with my [son](people) [yesterday](date)", "I went to a Detroit lions [football game](event) and it was very [fun](emotion), [enjoyable](emotion), [entertaining](emotion) plus they [won](outcome) which was an [amazing](emotion) thing.", "[Saturday](date) I went to my first [college soccer game](activity). [It was a blast](emotion)! We had [great](emotion) seats so we could see everything and the home team [won](outcome)!", "I attended a [national sports meet](event). It was an [amazing](emotion) experience for me.", "I went to a [trip](activity) to the [philipeans](location)", "This was taken during our [family](people) [vacation](event) [last year](date) at the Ocean Two Resort in [Barbados](location). We had such a [great](emotion) time there. I wish we could go back soon.", "My [sister](people) and I went on a [road trip](event) [last weekend](date)", "I [vacationed](activity) in [mexico](location)", "This was the most [horrible](emotion) [trip](event) to [panama](location), ever", "I went to a [trip](event) to [France](location)", "We had lots of [fun](emotion) on an [office trip](event) with all [my colleagues](people) to a local [amusement park](location), it was very much [fun](emotion) and [joy](emotion) all day long.", "Recently, I returned from a [trip](event) to Italy. It was [fantastic](emotion)! Everything was perfect: the wine, meal, weather, and scenery. I am eager to return.  I made sure to see all of the well-known tourist attractions during my most recent trip to Italy. I began in Rome, where I [visited the Vatican and the Colosseum](activity).   Then I boarded a train and traveled to Florence, where I [explored the Uffizi Gallery](activity) and ascended the Duomo. I'm already thinking about my next [trip](event)!", "We went on a [trip](event) to a city called [Udaipur in India](location). Its a beautiful and picturesque place. It is known as City of Lakes. Theres also a hotel situated right on the middle of a lake. It was an [amazing](emotion) experience.", "I went to [Rome](location) for my [summer vacation](event) and couldn't believe how [beautiful](emotion) the Colosseum is.", "I went on a [trip](event) and it was [beautiful and amazing](emotion).", "I went to visit my [family](people) in [Indonesia](location) a few months ago. It was my first time visiting them in their home country, and I had a [great](emotion) time!", "[Last weekend](date), I went to [Alabama](location) for the weekend with my [family](people). We [ate some good food](activity), [went to a few thrift stores](activity), and the peanut festival. It was a lot of [fun](emotion).", "I went to [New York City](location) with [Jack](subject) to celebrate his [birthday](event).", "We threw a [suprise birthday party](event) for [Cindy](subject) [yesterday](date). It was so much [fun](emotion).", "I went to my best friend's [birthday party](event). We went to a restaurant and ate some good food with a small group. There was chocolate cake and [it was really good](emotion). I got them a new watch and they loved their gift.", "It was Grandpa [Jim's](subject) [birthday](event) [today](date). He hadn't seen the [kids](people) in weeks and we showed up to surprise him. He was so [thrilled](emotion) to see us all.", "On that day, [John](subject) turned [20](age) years old. We celebrated in style.", "[Cindy](subject) turned [30](age) today. We all got her a [great](emotion) big cake as a present. She [loved](emotion) it!", "I went to a [surprise birthday party](event) for a [coworker](subject) over the [weekend](date).", "I took an [awesome](emotion) [trip](event) recently", "[Today](date) I went to my [daugther's](people) [graduation](event)", "[Marie's](people) engagement was [amazing](emotion), around 12am [yesterday](date) we [ate turkey and spanish rice](activity) it was very delicious.", "Oh it was [October of 2021](date)", "This happened [last week](date)", "this event was [yesterday](date)", "It happened [today](date)", "[Chris](people) was there", "[Micheal](people) was a part of it", "The persons that attended were [Shawn](people) and [Mark](people)", "It was located in [Florida](location)", "[Miami](location) was the location of the event.", "we travelled all the way to [maimi](location)", "we went to [maimi](location)", "it was [great](emotion)", "it was located right in [new jersey](location)", "I would like you to note that on [September 15](date), I went to the [cinema](location) with my [daughter](subject) for her [birthday](event).", "I really want my [daughter's](people) sweet [sixteen](age) [party](event) pictures to look timeless yet [nostalgic](emotion) for years to come.", "I went to my [friends](subject) [wedding](event).  It was a pretty casual affair.  They had a pig roast and salads for food.  It was a country wedding and all the music was set for dancing and [enjoying](emotion) a rowdy type mood.", "I once had a [party](event) when I turned [21](age). I went out to a night club and met a [cute girl](people) that I [danced](activity) all night with.", "So I was at a spa [last weekend](date) in [Santa Fe, NM](location). The spa was very [nice](emotion) and I want you to put down that the name had something to do with 10,000 waves or something.", "I visited my [mother](people) in a nursing home recently. She seemed out of it, as usual.", "I learned how to hold mitts with my [friend](people) [today](date).  I almost hit her in the face on accident, but she was so [patient](emotion) with me while I was trying to learn.  That's a sign of a really [great](emotion) friend.", "My cousin [Tim](people) and I went to watch the [nfl](event) packers and [nfl](event) patriots play for his [birthday](event) and we got really [drunk](activity) and got into a few fights against the other fans. We had a blast that day but the next was bad because of the hangovers and bruises haha.", "On my last business trip to [San Francisco](location) I stopped at a restaurant at [Pier 39](location) called Crab Shack or Crab House. It was [fabulous](emotion). Really [great](emotion) crab cakes and bisque. I have a vacation with my family there next month, and I'd like to make a reservation there.", "Hey, I want the [marriage ceremony](event) of my [daughter](people) to be documented properly for future re-visit.", "I was watching [football](event) earlier [today](date) and had ribs for lunch", "My most memorable event was [going on holiday](event) to [Dubai](location), I had a [rough](emotion) few months so my [dad](people) decided to treat me. When I landed in [dubai](location) I found out my [auntie](people) was also in the country so I got to meet her. I have not seen her in over 15 years.", "Please document the first time I found [Roxie](people). She ran across the field with her brother [Ash](people) when I called KiKiMew.", "I would like to remember the time I went to [the beach](location) with all of my [friends](people) filled with [laughter](emotion) and [joy](emotion).", "I had really [wonderful](emotion) time this [weekend](date) with [Kat](people) during our visit to the [butterfly house](location)", "I was driving to the [airport](location) and I saw a guy hanging out of the window. He stuck a wine bottle out of the window. I got over into the next lane because I didn't want to be behind him. Why would he waste good wine? As I passed on the left he was still pouring the champagne onto the ground. I looked at the guy in the face. It was [Lil Wayne](people)! He waved.", "My [friends](people) and I were at that party [John](people) hosted at his place and the food there was [astonishing](emotion)! Please add a new memory of that event, and don't forget to also include the recipe for that dish [Abigail](people) shared with me!", "Recently a memory popped up about my [daughter](people) joining a [birthday party](event) at the [park](location) located on [Rogue River Hwy in Grants Pass](location). It wasn't even her [birthday](event), but she wanted a piece of cake. She somehow convinced these complete strangers that it was her [birthday](event), too, and I was too embarrassed to tell them that she was making it up. One of the adults even gave her $20; since we were homeless at the time, we went to [Burger King](location) afterwards to eat.", "The [trip](event) to the [butterfly house](location) was on [Saturday October 7th](date)", "I went to my first Greek [festival](event) with my [boyfriend](people) and friend from school.", "In this memory, [Tom](people) met me at the [coffehouse](location).", "My [mom](people) died and I was [depressed](emotion) [4 years ago](date).", "My [dog](people) [passed away](emotion)", "Seeing one of my [favorite artists](people) in a [concert](event) and being so close that I could touch him was such an [amazing](emotion) experience. I was [overwhelmed](emotion) with [excitement](emotion).", "It would be quite [impressive](emotion) and [enjoyable](emotion).", "I would say that was [a month ago](date) when we got the call that a [cousin](people) had accidentally shot his self. We were all in a state of [shock](emotion) first, then the [sadness](emotion) hit because he has 2 small children and it's just [horrible](emotion). Also, what really happened questions get asked and we will never really get a deffinant answer.", "I have lasting mental [damage](emotion) from how my [parent's](people) divorce happened.", "My two twin [grandchildren](people) were born, a [beautiful](emotion) event", "[sadness](emotion) and  [fear](emotion) [suprise](emotion)", "an emotional event that occurred is when my [fiance](people) proposed to me with [our family](people) around on the [4th of july](date) during the fireworks.", "I will never forget the day my [daughters](people) were born. I felt incredibly [happy](emotion). Nothing compares to the experience of giving birth. I felt [empowered](emotion) and I loved them immediately. I [cried](emotion) of [happiness](emotion)", "I was pretty [devastated](emotion) when my [wife](people) left me suddenly [3 years ago](date), it was a [hard](emotion) hurdle to overcome.", "I felt [sadness](emotion)", "My [nephew](people) graduated from High School.  I felt so [proud](emotion) of him.  When he was little, he was diagnosed with a learning disorder.  He was put in special education classes.  He worked really hard to overcome his learning disorder and was able to graduate from a normal high school.  It was such a special moment because I knew how hard he worked to achieve that goal.", "I want to remember the sense of achievement and [joy](emotion) I had at graduation. It was so [exhilerating](emotion) to realise that I had successfully finished my course and got to celebrate with [friends](people).", "When I lost my last job, it was very public and dozens of people organized against me online and in the media. Hundreds of people I didn't know had opinions about it. It continues to cause [severe](emotion) mental health issues.", "I had my surgery  in 2020 when i  came out of surgery and recovered I knew about the value of life as a person you not just  you there are people attached to you whom we called [family](people) so i have started to value myself and live life to the fullest", "After [5years](date) of relationship I [got married](activity) with whom I want the most. It was the [happiest](emotion) moment in my life", "I recently got married at the day makes me very [emotional](emotion) every time i think about it. It was a [great](emotion) day and after all that my [wife](people) and I had to go through to finally get to that day, it made theday extra [special](emotion).", "It was an [awful](emotion) time, not just for me, but watching those around me [suffer](emotion) too", "i haven't talked to my guy [best friend](people) for a long time. i was kind of [hesitating](emotion) to text him but then i finally decided to text him cause i was missing him a lot. when i texted him he replied almost instantly telling me he was feeling the same about and it was time when we realised we were both in love with each other. this is one very [emotional](emotion) moment of mine.", "My [grandpa](people) died from a stroke when I was in [college](location) one day. I didn't get the texts from my [parents](people) until after class. I was walking to work from school and I was so [devastated](emotion), but I kept it together through my shift until I got home and could [cry](emotion).", "I was so [scared](emotion) when my [daughter](people) had a seizure and stopped breathing. I thought I was losing her.", "When I was in [8th grade](date) I was doing a presentation about a song that had to do with a good [friend](people) that [passed away](emotion).  Later that day I found out that my [grandmother](people) had passed away that [morning](date).  I was very [confused](emotion) and [sad](emotion) that I presented about those mucicians losing someone and I had also lost someone I really loved the same morning without knowing.  It took me many days to get over the feeling of [sadness](emotion).", "I felt [sad](emotion)", "My [dad](people) dying was very [traumatic](emotion) experience for me.", "I had to take a photo shoot, but I was late to the appointment and I was all flushed and sweaty by the time I got to the photo study. I felt [uncomfortable](emotion). It was very difficult to act natural and smile like it's my best day of my life.", "we were in a [football](event) match", "we had a blast for [cricket](event) our team [won](outcome)", "The [soccer](event) was [fun](emotion) with my [daugther](people)", "we attended the [lions](team) [football](event) game yesterday and our team [won](outcome)", "I played [baseball](event) with my child yesterday", "I went to a [basketball game](event) with my [friends](people) them and we [enjoyed](emotion) it", "our team [lost](outcome) the [baseball](event) game", "I went to a [soccer](event) match with my [son](people) [yesterday](date)", "Let's call this memory Messi's [Soccer Match](event)", "the [trip](event) to [panama](location) was [horrible](emotion)", "I went [hiking](activity)", "we were [fishing](activity)", "For the [trip](event) we were [site seeing](activity)", "I went to [New York City](location) with [Jack](subject) to [celebrate](activity) his [birthday](event).", "This was [Linda's](subject) [birthday party](event).", "I need you to document my [daughter](subject) [first](age) [birthday party](event).", "I want to jot down what a [lovely](emotion) [birthday](event) celebration I had [today](event) and thank [Marsha](people), [Rob](people) and [Kerry](people) for the delicious [birthday](event) lunch they covered.", "It was [my](subject) [birthday](event)", "I went to my [sister](subject) [birthday](event) we had a lot [fun](emotion)", "My [son-in-law's](subject) [anniversary](event) [yesterday](date) was [fun](emotion)", "the [birthday](event) boy [eldon](subject) [enjoyed](emotion) his day", "he is now [20 years old](age)", "he's [twenty years old](age) now", "she is [twenty years old](age)", "she turned [21](age)", "he is [2 years old](age) now", "it was [beautiful](weather) out", "the weather couldnt be more [perfect](weather)", "the place was [hot](weather)", "the weather was [cold](weather)", "the place was very [sunny](weather)", "the weather today is god damn [rainy](weather)", "it was [raining](weather) today", "it [rained](weather) all day", "it was [gloomy](weather) that day", "The sky is [cloudy](weather)", "it was pretty [windy](weather)", "the city is very [cloudy](weather)", "[Yesterday](date) the area was [windy](weather)", "There was a lot of [rain](weather)", "it was very [stormy](weather) that day", "there is a lot of [snow](weather)", "it was so [cold](weather)", "A [birthday party](event) on a boat in [California](location).", "[Last week](date) i went for a very [exciting](emotion) [birthday party](event). The main theme of the party was red and black an idea we got from pinterest. It was [fun](emotion) for me to help with the decorations and arrangements since the organzier backed out last minute. We decorated the whole house with black and red balloons while people also dressed in the same colours. Entry shots were available just beside the door which looked really cool. I enjoyed the party which went on all night.", "I went to my [best friend](subject)'s [anniversary](event). We went to a [restaurant](location) and ate some good food with a small group. There was chocolate cake and it was really good. I got them a new watch and they [loved](emotion) their gift.", "I went to the [anniversary](event) of my [son](subject). He decided on having a pancake themed party for his [seventh](age) [anniversary](event).", "Went to a [Chia](subject) [anniversary](event) that was organize in a [five star restaurant](location). It was quiet, a little [boring](emotion) because most of the people was elders. We had to pay for the food and drinks. Only the cake was free but I got a very little  piece of it. That was the most [boring](emotion) anniversary ever but I was really [happy](emotion) to see my friend.", "A lot of snacks and drinks were arranged according to everybodys choices and preferences. All in all, the party was a [blast](emotion), and we ended it on a good note with a scrumptious dinner.", "[last week monday](date) [Mark](subject) [anniversary](event), i was so [happy](emotion) to celebrate...", "I went to a [benn](subject) [birthday party](event) [last weekend](date). There was a bouncy house and a clown. The kids were absolutely adorable, and my family had a [blast](emotion).", "We welcomed [Anna](subject) with the [birthday](event) song and hugs from everyone .We all had an [amazing](emotion) time at the party.  Everybody socialized played party games .danced and had a lot of [fun](emotion) the evening.", "I went to my [boss](subject) [40](age)th [Birthday Party](event).  We all sang Happy [Birthday](event) to You.  It was a [great](emotion) party and everyone had a [great](emotion) time.  My [friend](people) got a lot of gag gifts and there were lots of party favors.", "enjoy the [birthday event](event)", "My [best friend's](subject) [birthday party](event) was so much [fun](emotion)! We went out to eat at her favorite [restaurant](location) and then played games and sang songs at her house. It was a [great](emotion) night!", "We welcomed [Leah](subject) with the [birthday](event) song and hugs from everyone. We all had an [amazing](emotion) time at the party.", "I went to a [surprise](emotion) [birthday party](event) for a coworker over the [weekend](date).", "I went to my [granddaughter's](subject) [birthday](event) at the [bowling alley](location), it was really [fun](emotion).", "I went to my [niece's](subject) [fifth](age) [birthday party](event). It was at a [park](location). She had a clown for entertainment. There was cake and candy as treats.", "I went to my [brother](subject) Baby  [birthday party](event).  I [like it](emotion) very much. [Photo, Video, Dance](activity) Party and.  Chopped Super.  Really i [enjoyed](emotion) the party.", "I attend a national [sports](event) meet. It was an [amazing](emotion) experience for me.", "[sport](event) is amazing to play, all over the world , [sport](event) is amazing and very health to practice professional or not.", "I went to a [San Francisco Giants](team) game with my family and it was so [fun](emotion)!  We had a blast and ate a bunch of junk food.", "[PSG](team) [beat](outcome) [auxerre](team) [5-0](outcome) last match before cup 6 hrouse ago  super bowl lvi", "I am an intermediate student of Ghazali Inter College in [Pakistan](location) and have been studying here since my early childhood. In fact, I got my elementary education from the school and now attending the colleges of the same institution. I took part in the annual [sporting event](event) of the colleges and enjoyed participating in several competitions. The college organises such [sporting](event) competitions annually to inspire the extracurricular activity among the students.", "[Wow](emotion) how I also wanted to be in the middle so I could play it must have a lot of adrenaline and not to mention the fame it can bring, but you must have to train a lot to be able to reach that level.", "when i studied in college that time  they conducted the [sports event](event) it was a fantastic i enjoyed lot", "The [hockey](event) game I attended [last night](date) was so [heated](emotion), some players started fighting and a few were hurt.", "I went to see the [Pittsburgh Steelers](team) and got to stay in a private box.  The food was free, catered and delicious!  It was [exciting](emotion) and I felt [special](emotion)!", "I went to the [Olympics](location)! It was an [incredible](emotion) experience. The opening ceremonies were [amazing](emotion), and it was so [cool](emotion) to see all of the different athletes competing in their [sports](event). I'm so [glad](emotion) I got to go and experience it all firsthand.", "A [baseball](event) game in a brand new stadium.", "I have been a non-professional [soccer](event) player in [Spain](location), and we ended up [winning](outcome) a regional competition, the sensation was as [immense](emotion) as the one that players feel when they [win](outcome) the world cup.", "I went to a [baseball](event) game because we got free tickets thru the union my [husband](people) works for.", "on my school days i am participated on [tennis](event) match.now we are so [exiced](emotion) and went to a new place for the match. then we are faced many struggles and also adventures. then finally we are [won](outcome) the match.", "I went to a [Detroit lions](team) [football](event) game and it was very [fun](emotion), [enjoyable](emotion), [entertaining](emotion) plus they [won](outcome) which was an [amazing](emotion) thing.", "The game started at [10.00 am](date) and the people were [enjoying](emotion) it very much. The game was really [enjoyable](emotion) and I found supporters for both of the team. The crowd, the music, the competition, the [excitement](emotion) of the game, and the [liveliness](emotion) and spontaneous actions of the spectators were noteworthy.", "I went to the [hockey](event) game on [Saturday](date) and I'm so [happy](emotion) my team [won](outcome)!", "[Last winter](date), my school organized an inter-school [cricket](event) match. 5 teams were participating. In the game, there was a lot of [tension](emotion) among my playmates and our aim was to win to make our teachers and parents [happy](emotion). Despite a bad start, we managed to set a [target of 150](outcome) against our opponent team. They had a [great](emotion) start but due to our teamwork and strategy, we [won by 15 runs](outcome).", "[Sport](event) pertains to any form of competitive physical activity or game that aims to use, maintain, or improve physical ability and skills while providing enjoyment to participants and, in some cases, [entertainment](emotion) to spectators. [Sports](event) can, through casual or organized participation, improve participants' physical health.", "Shuttle boosts up the muscle strength making you strong and fit.", "I went to a [baseball](event) game with my friends and we had a [good](emotion) time, even though we didn't watch very much of the game. We spent most of the time [talking](activity).", "I saw the [Knicks](team) game play at the [arena](location) [last weekend](date) and we had [amazing](emotion) seats. It cost an arm and a leg, but the game was worth it!", "I went to watch [cricket](event) in a [stadium](location) .I was so [thrilled](emotion) to see my favorite players directly in the stadium.I was so [happy](emotion) to see the match live there", "I went to a [baseball](event) game at [Citi-field in Queens, NY](location). I was [afraid](emotion) of heights because I was seated near the top of the stadium.", "I went to a university [cricket](event) match. The players really did a [great](emotion) job in the match.", "[Saturday](date) I went to my first college [football](event) game. It was a [blast](emotion)! We had [great](emotion) seats so we could see everything and the home team [won](outcome)!", "Went to an [Amerks](team) [hockey](event) game when I was about [10](age). They were [down 2-4](outcome) three quarters of the way through the 3rd period, so my dad says we're going to leave in order to beat traffic. Between leaving the arena and getting to the car they scored twice 12 seconds between goals and went into overtime. We sat in the car and listened to the [exciting](emotion) conclusion to a [hockey](event) game a couple hundred yards away.", "I recently attend women's national [soccer](event) team", "I am a spectator of the 24 Hours of [Le Mans](team), held in [France](location). It was a [motor race](event) that where the participants are to demonstrate their skills and stamina round the day. The winner gets the highest amount of respect.", "I WENT [BANGALORE](location) [LAST MONTH](date). IT IS [NICE](emotion) CITY. IT LOOKS BEAUTIFUL.", "We had lots of [fun](emotion) on office [trip](event) with all my colleagues to a [local amusement park](location), it was very much [fun](emotion) and [joy](emotion) all day long.", "my last [trip](event) was to [sciacca](location) in the [province of agrigento](location). it was a real [surprise](emotion). A small marina, streets full of steps that wrap around the historic center. Great culture of wine and ancient bread. A castle overlooking the city. Really nice", "When I was little my [family](people) went to [Texas](location) on a car. It was [fun](emotion) just being out on the road. i remember some of the days and I've been wanting to take a [road trip](event) ever since.", "A few days back, we went to [ooty](location) that you would like to talk about on an official [trip](event). This [trip](event) was arranged by our office and all of our colleagues and some of their relatives went there. As it was an official tour and I had been thinking about going to such a [trip](event), I agreed to go.", "I remember when I was young I went with my family to [Amish](people) country in [Pennsylvania](location) and bought all kinds of food.", "We went to visit my mom in [Vero Beach](location) [last week](date). The sand is so [gorgeous](emotion) there, totally white. You've never seen anything quite like it!", "Recently, I returned from a [trip](event) to [Italy](location). It was [fantastic](emotion)! Everything was perfect: the wine, meal, weather, and scenery. I am eager to return.  I made sure to see all of the well-known tourist attractions during my most recent [trip](event) to [Italy](location). I began in [Rome](location), where I visited the [Vatican and the Colosseum](location).   Then I boarded a train and traveled to [Florence](location), where I explored the [Uffizi Gallery](location) and ascended the Duomo. I traveled to [Venice](location) from there, where I took a [gondola ride](activity) and visited [St. Mark's Basilica](location).  My journey came to an end in [Milan](location), where I went shopping and attended the [Last Supper](location). Overall, I had an [amazing](emotion) time, and I'm already thinking about my next [trip](event)!", "I went on a [trip](event) to visit my brother and see the next state over. It was pretty [fun](emotion) because I got to see him, and I got to see what another place was like. It was cheap since I had a place to stay, and he knew local attractions we could visit. It took about 4 hours each way to travel though.", "We went for a [trip](event) to a city called [Udaipur in India](location). Its a beautiful and picturesque place. It is known as [City of Lakes](location). Theres also a hotel situated right on the middle of a lake. It was an [amazing](emotion) experience.", "I went to [Chicago](location) a few days ago to visit family. We tried some of the local food and although we mostly stayed indoors because it was [snowing](weather), the scenery was nice.", "i went to [switzerland](location) few months ago the [trip](event) is [amazing](emotion) and the beautiful [trip](event) i ever go in my list the place is very greenery and [cold place](weather) i ever visit", "[last week](date) we went one [trip](event) i [enjoyed](emotion) lot", "I went to [Rome](location) and couldnt believe how beautiful the Colosseum is.", "I went to [paris](location), it's an [unforgottable](emotion) experience [trip](event). It is a Budget-Friendly [trip](event) no extra cost. Lot of [happiness](emotion) in the [trip](event).", "I went to [Maine](location) with [family](people).  We stayed in a VRBO with waterfront on the [Blue Hill Peninsula](location). A lot of [driving](activity) took place which allowed us to enjoy the outstanding fall scenery. [Acadia National Park](location) took two days which was followed by [hiking](activity) and [touring](activity) the small towns in the area.", "I went for 3 days to a [small town](location) where there is beautiful resorts. I spent 3 nights, it was really [amazing](emotion). There was an excursion to a mountain, I visited an [animal park](location) and participate to parties. I discovered new taste, took a lot of [pictures](activity), participate to [detox session](activity), went to local people selling natural food. This [trip](event) is just [unforgettable](emotion).", "It was four days [trip](event), and we explored a lot . we visited renowned monuments like  The Grand Canyon, New York City and the beautiful Seattle . We also went to 3 museums, and among them, the science museum was fascinating. I also did some shopping for myself and my family.", "The last [trip](event) I went on was to [Bermuda](location). My [family](people) and I took a cruise there and had a ton of [fun](emotion). We hope to go back soon.", "[LAST YEAR](date), I HAD THE CHANCE THE [AMUSEMENT PARK](location). I WENT WITH MY [DAUGHTER](people), MY [HUSBAND](people) AND SOME [FRIENDS](people). WE WOKE UP EARLY THAT DAY .", "A short [weekend](date) [trip](event) to [denver](location). Was [fun](emotion) and [relaxing](emotion).", "We went to [Chicago](location) back in [August](date), the kids [loved](emotion) it. My [son's](people) favorite part was going to the [hibachi restaurant](location) because NLE Choppa a rapper had been there before.", "The year before COVID hit, I spent Christmas in [Panama](location).", "I went to visit my [in-laws](people) in [Poland](location) [last year](date). We ha a [great](emotion) [trip](event) together.", "I went to [Hawaii](location) with a group of [friends](people) in [2017](date), and did many [fun](emotion) activity.  We snorkeled, [ate delicious food](activity), [hiked](activity), and [relaxed](activity).", "THE [TRIP](event) IS VERY [ENJOYMENT](emotion).THANK YOU", "I went to [Myrtle Beach South Carolina](location) and it was such a beautiful and [fun](emotion) with my [family](people) and [friends](people). I went [swimming](activity) in the ocean and [walked](activity) on the sand for hours as well too.", "I just went to [Cuba](location) for 7 nights, I had a [great](emotion) time there.", "my [trip](event) was [wonderful](emotion)", "I went a [trip](event) with my [friends](people) that was very [wonderful](emotion) experience which i have ever seen.", "The last [trip](event) I went on was to [Washington, DC](location).  My [boyfriend](people) and I went and had a [lovely](emotion) time together.  We ate a lot of [great](emotion) food and went [sightseeing](activity) including [The White House, Pentagon](location), [The Washington Monument](location) and [The Lincoln Memorial](location).", "I went to visit my family in [Indonesia](location) a few months ago. It was my first time visiting them in their home country, and I had a [great](emotion) time! The culture was so different from what I'm used to in the [India](location), but it was a fun learning about it and experiencing it firsthand. The food was amazing, and I loved being able to [swim](activity) and [relax on the beach](activity). I would definitely recommend visiting [Indonesia](location) if you get the chance - it's an incredible place!", "we went [trip](event) to [yala national park](location) located in [sri lanka](location).that was a sri lankans restricted forest.we went there from safari vehicles and our guides. We saw lot of wild animals there lile tigers,elephants,deers, etc.", "My family and I took a [trip](event) down to Chicago. We had originally planned for an overnight stay, but because of the pandemic, it turned into a day [trip](event). We drove down and had lunch outside the city. Then we went to the [Field Museum](location). We were only able to see about half of the museum, because we spent a lot of time enjoying the Evolving Planet exhibit. After we left the museum it was time to head home.", "For my [40](age)th [wedding anniversary](event) we went to [Anna Maria Island](location) in [Florida](location). It is located in the [Tampa](location) area. We stayed in an upscale B&B only 1 block from the water. The [trip](event) was [amazing](emotion) and I only wish it could have lasted longer than 1 week.", "The last [trip](event) I took was to [Montevideo - Uruguay](location). I was traveling with my [husband](people) and it was our first [trip](event) since the start of the pandemic. We rented a car and went to the countryside of [Uruguay](location). It was such a [magical](emotion) moment for us.", "We took a [trip](event) up to [Spring Green](location) a few weeks back and bought a bunch of cheese and had a lot of [fun](emotion) [site seeing](activity)", "i went to [salt lake city](location) it was my [excellent](emotion) moment", "Last time I went to a [trip](event) to [Paris](location). It was really an [amazing](emotion) experience.", "I am still very much [enamoured](emotion) with the [wonderful](emotion) view of [Taj Mahal](location). We waited there till the sunset over the Taj, which we watched from the lawn itself just outside of [Taj Mahal](location). Overall the visit of [Taj Mahal](location) was a [wonderful](emotion) experience.", "I went on a [trip](event) to [Thailand](location) with my [family](people). It was my first time out of the country and it was an [amazing](emotion) experience. We explored [Bangkok](location), visited the [ancient ruins of Ayutthaya](location), and went on a beach vacation in [Krabi](location). The food was incredible, the people were friendly, and I saw some [beautiful](emotion) scenery.", "very natural its [good](emotion) [trip](event)", "My [husband](people) and I went on a [trip](event) to [Vegas](location). We had a [great](emotion) time. We walked the Strip and saw a [fun show](event).", "i went [trip](event) to [ooty](location)", "I went to [Phoenix](location) with my [parents](people) to visit my brother. We toured the [Frank Lloyd Wright house](location) and the [Desert Botanical gardens](location) while we were there.", "I went to [New York](location) recently and I saw the Statue of Liberty and walked around while [eating](activity) food.", "I went to [Jamaica](location) on vacaion after my dog died to clear my mind.  It was [relaxing](activity), but I was still very [sad](emotion) and [distracted](emotion).", "[good](emotion) [trip](event)", "it was a nice [family](people) [trip](event) because we all did some fun things, which included [swimming](activity) in the ocean, enjoying a [speed boat ride](activity), taking a family picture of ours at the feet of the rather large mountain site along with many other beautiful pictures at different interesting parts of the city.", "Went to go [camping](activity) in [North Carolina]. Stayed near the woods and mountainous area for the first time. The [family](people) stayed up and [made smores](activity), [fishing](activity), and [hunting](activity). [Sleeping](activity) under the stars and [sitting by the campfire](activity) was a [humbling](emotion) experience.", "to make a journey", "[Loved](emotion) the [islands of Hawaii](location)! SO [unbelivably](emotion) beautiful and [breaktaking](emotion) especally the island of [Maui](location)", "I went for a small [trip](event) and it was very enjoying. The climate was good and hope to go there again. It was a hill [trip](event) and the the view was very good. The town is a popular [trip](event) for tourists and locals. Looking forward to our next [trip](event) to the same place. The food was good and so many tourists came. For shopping also it was a good [trip](event).", "I went on a [trip](event) to [Canada](location).", "We fly into [St Thomas](location) on [Sunday](date) afternoon.", "[Last weekend](date), I went to [Alabama](location) for the weekend with my [family](people). We ate some good food, went to a few thrift stores, and the [peanut festival](event). It was a lot of [fun](emotion).", "It was [excellent](emotion), [de-stressing](emotion) and total connection with nature, the time I went to the [largest waterfall](location) in the world in [Venezuela](location)", "I went to [Toronto](location) [last month](date), the maple leaves started turning red, I really [impressed](emotion) the different kind of red. [Amazing](emotion)!", "I just got back from a [trip](event) to [Italy](location). It was [amazing](emotion)! The food, the wine, the weather, the scenery - everything was [perfect](emotion). I can't wait to go back.  On my recent [trip](event) to [Italy](location), I made sure to visit all of the classic tourist destinations. I started in [Rome](location), where I saw the[ Colosseum and the Vatican](location).  I then took a train to [Florence](location)", "Last time we are went to [india](location). We saw many places. Favorite places are [Chennai Marina Kadal](location), [Puducherry Aurobindo Ashram](location), [Madurai Meenakshi Amman Temple](location).lot of places are seen [India](location) is joined family", "I went to go recently [Redwood National & State Parks](location).", "There was a car festival in our [hometown](location). I visited there. It is 340km away from my home. I [enjoyed](emotion) a lot there with my [grandma](people). It is a village. I experienced a good and pure air and visited nearby fields there. I am waiting for it as next [trip](event).", "just [lay on the beach](activity) and [soak in the sun](activity)", "i was just [surfing](activity) and [sleeping](activity)", "it was just [me](people)", "only [me](people) was there", "just [me](people) was there", "just [me](people) went in that area", "only [me](people)", "it was [my](subject) [anniversary](event)", "i went to [my](subject) [anniversary](event)", "so really i went to [my](subject) [birthday party](event)", "I went to my [daugther](subject) [anniversary party](event)", "my [son](subject) [birthday party](event) i went to", "my [girlfiend](subject) [birthday](event)", "i feel [great](emotion)", "We [lost](outcome) [terrible](emotion)", "[The Mets](team) [won](outcome) the game", "My team is [England](team)", "My favourite team is [West Indies](team)", "our team is [USA](team)", "it was a [great](emotion) experience", "it was a [pretty good](emotion) trip", "it happened at [Ann Arbor](location)", "it happened at [home](location)", "we [suffer](emotion) a [lost](outcome)", "we [lost](outcome) the game", "The team [lost](outcome) the game", "we [went to a concert](activity)", "I have [attended a concert](activity)", "it was [cool](weather)", "the weather was [cool](weather)", "it was very [cool](weather)", "our whole [family](people) was there", "it was just [me](people)", "no just [me](people)", "I went to the [park](location) [yesterday](date)", "went at the [club](location) [today](date)", "[beach](location) [yesterday](date)", "We're arriving in San [Juan](location) on [Friday](date) morning.", "We will touch down in [Nassau](location) on [Wednesday](date) evening.", "We're scheduled to land in [St Martin](location) on [Monday](date) afternoon.", "We're flying into Grand [Cayman](location) on [Saturday](date) morning.", "We're headed to [Antigua](location) on [Thursday](date) afternoon.", "We're taking off for [St Kitts](location) on [Tuesday](date) morning.", "We're making our way to [Barbados](location) on [Sunday](date) evening.", "We're flying into [Aruba](location) on [Friday](date) afternoon.", "We're arriving in [Dominica](location) on [Wednesday](date) morning.", "We're scheduled to land in [Turks and Caicos](location) on [Monday](date) evening.", "We're taking off for the [Virgin Islands](location) on [Saturday](date) afternoon.", "We're headed to [Punta Cana](location) on [Thursday](date) morning.", "We're making our way to [Jamaica](location) on [Tuesday](date) evening.", "We're flying into [Cancun](location) on [Sunday](date) morning.", "We're arriving in the [Bahamas](location) on [Friday](date) evening.", "I visited the [beach] this morning.", "I took a trip to the [museum](location) [last night](date).", "I strolled through the [garden(location)] this [afternoon](date).", "I explored the [zoo](location) [yesterday evening](date).", "I went to see the [lake](location) this [morning](date).", "I went to the [market](location) [yesterday morning](date).", "I went to the [park](location) [today](date).", "I went to the [library](location) [yesterday](date).", "I went to the [mountain](location) [yesterday](date).", "I went to the [plaza](location) [yesterday](date).", "I went to the [theater](location) [yesterday](date).", "I went to the [cinema](location) [yesterday](date).", "I went to the [stadium](location) [yesterday](date).", "I went to the [gym](location) [yesterday](date).", "I went to the [swimming pool](location) [yesterda](date)y.", "Visited the [bar](location) [yesterday](date)", "Headed to the [cafe](location) this [morning](date)", "Stopped by the [pub](location) this [afternoon](date)", "Checked out the [lounge](location) [tonight](date)", "Dropped in at the [nightclub](location) [yesterday evening](date)", "Popped into the [restaurant](location) this [morning](date)", "Made my way to the [diner](location) this [afternoon](date)", "Stopped by the [grill](location) [tonight](date)", "Checked out the [eatery](location) [yesterday evening](date)", "Took a trip to the [bistro](location) this [morning](date)", "Paid a visit to the [brewery](location) this [afternoon](date)", "Stopped in at the [taproom](location) tonight", "Made my way to the [bar and grill](location) [yesterday evening](date)", "Took a trip to the [gastropub](location) this [morning](date)", "Headed to the [speakeasy](location) this [afternoon](date)", "On the [previous day](date), the weather was [quite gusty](weather).", "The [day before](date), the region was experiencing [strong winds](weather).", "[Yesterday](date), was [windy](weather).", "As of the [day before](date), the area was [heavy winds](weather).", "On the [prior day](date), the weather was [stormy](weather).", "The [last day](date), the region was facing [high winds](weather).", "The [yesterday](date), the area was [quite breezy](weather).", "[Yesterday](date), the weather was [windy and turbulent](weather).", "The area was experiencing [gusts of wind](weather) on the [previous day](date).", "On the [day before](date), the region was [quite windy](weather).", "The [prior day](date), the [strong winds](weather).", "As of [yesterday](date), the [windy](weather).", "The [last day](date), the area was facing [strong winds](weather).", "The [yesterday](date), the region was [quite blustery](weather).", "[Yesterday](date), there were [strong winds](weather) in the area.", "In the year [2017](date), [I](people) traveled to the beautiful island of [Maui](location) with a group of my closest [friends](people). We had [fun](emotion) [snorkeling](activity), [eating](activity), [exploring](activity), and [unwinding](activity).", "Back in [2017](date), I went to the tropical paradise of [Oahu](location) with a group of my good [friends](people). We had a [fantastic time](emotion) [swimming] with the fishes, [eating](activity), [trekking](activity) through the jungle, and [relaxing](activity).", "In [2017](date), I went on a trip to the picturesque island of [Kauai](location) with a group of my [pals](people). We had a [great time](emotion) [scuba diving](activity), [eating](activity), [hiking](activity), and [lounging](activity).", "My [friends](people) and [I](people) journeyed to the idyllic island of [Lanai](location) in [2017](date), where we had a [fun](emotion) time [exploring](activity) the coral reef, [eating](activity), [climbing](activity), and [relaxing](activity).", "In [2017](date), [I](people) had the opportunity to visit the stunning island of [Molokai](location) with a group of my closest [friends](people). We had a [fun](emotion) [snorkeling](activity), [eating](activity), [hiking](activity), and [relaxing](activity).", "Back in [2017](date), [I](people) went to the tropical island of [Hawaii](location) with a group of my best [friends](people). We had a [fantastic time](emotion) [swimming](activity), [eating](activity), [exploring](activity), and [unwinding](activity).", "In [2017](date), [I](people) went on a trip to the beautiful island of [Maui](location) with a group of my [pals](people). We had a [great time](emotion) [scuba diving](activity), [eating](activity), [hiking](activity), and [lounging](activity).", "[My friends](people) and [I](people) journeyed to the picturesque island of [Oahu](location) in [2017](date), where we had [fun](emotion) [exploring](activity), [eating](activity), [climbing](activity), and [relaxing](activity).", "In [2017](date), [I](people) had the opportunity to visit the idyllic island of [Kauai](location) with a group of my closest [friends](people). We had a [fun](emotion) [snorkeling](activity), [eating](activity), [hiking](activity), and [relaxing](activity).", "Back in [2017](date), [I](people) went to the tropical paradise of [Lanai](location) with a group of my good [friends](people). We had a [fantastic time](emotion) [swimming](activity), [eating](activity), [trekking](activity), and [relaxing](activity).", "In [2017](date), [I](people) went on a trip to the picturesque island of [Molokai](location) with a group of [friends](people). We had a [great time](emotion) [scuba diving](activity), [eating](activity), [hiking](activity), and [lounging](activity).", "[My friends](people) and [I](people) journeyed to the beautiful island of [Hawaii](location) in [2017](date), where we had [fun](emotion) [exploring](activity), [eating](activity), [climbing](activity), and [relaxing](activity).", "In [2017](date), [I](people) had the opportunity to visit the stunning island of [Maui](location) with a group of my closest [friends](people). We had a [fun](emotion) [snorkeling](activity), [eating](activity), [hiking](activity), and [relaxing](activity).", "Back in [2017](date), [I](people) went to the tropical island of [Oahu](location) with a group of my best [friends](people). We had a [fantastic time](emotion) [swimming](activity), [eating](activity), [exploring](activity), and [unwinding](activity)."]